{
  "version": "https://jsonfeed.org/version/1",
  "title": "Nick Simson",
  "home_page_url": "https://nicksimson.com/",
  "feed_url": "https://nicksimson.com/feed/feed.json",
  "description": "Being the personal website of one Nick Simson, of Knoxville, Tenn.",
  "author": {
    "name": "Nick Simson",
    "url": "http://www.nicksimson.com/about/"
  },
  "items": [{
      "id": "https://nicksimson.com/posts/2022-redesign-earth-tones/",
      "url": "https://nicksimson.com/posts/2022-redesign-earth-tones/",
      "title": "Earth tones",
      "content_html": "<p>Nope, it is not déjà vu. I revised my website colors again. This time, if you are viewing my website in in light mode, you are seeing a rich brown text on a creamy, ivory-colored background. In dark mode, you are likely seeing light text on a rich chocolatey dark brown background.</p>\n<figure>\n    <img src=\"/img/post-images/2022-08-lightmode-darkmode.jpg\" class=\"panel\"\n         alt=\"NickSimson dot com slash info\" />\n    <figcaption>My info page in both light mode and dark mode</figcaption>\n</figure>\n<p>You can go ahead and read my post from October 2021 <a href=\"/posts/2021-redesign-dark-mode/\">detailing how I originally shipped a dark mode on this site</a> to see a screenshot of the previous implementation. Not much has changed on the technical front. After a few months of using my own site, I decided to change the color scheme with these warmer, earthier colors, because the blue links left me feeling a bit cold, especially in dark mode.</p>\n<figure>\n<img class=\"panel\" src=\"/img/post-images/2022-harvest-neil-young.jpg\" alt=\"Cover of Neil Young's 1972 album Harvest\" width=\"497\" height=\"487\" loading=\"lazy\"/>\n<figcaption>This album cover may or may not have influenced my website’s current color scheme.</figcaption>\n</figure>\n<p>Not much else to say design-wise. I have been using the Instapaper app for over a decade, as well as the reader view in Firefox (my main web browser of choice these days). Both of these reading apps support a “sepia” background option. Sometime last year, I stumbled across the <a href=\"https://en.wikipedia.org/wiki/Cosmic_latte\">Wikipedia entry for cosmic latte</a>, the alleged average color of the universe, represented by hex triplet <code>#FFF8E7</code>. In addition to being a bit of trivia or a miserable inside joke, this particular shade of beige is pretty easy on the eyes for longform reading.</p>\n<img src=\"/img/post-images/2022-color-blender-earthtones.png\" alt=\"Gradiation of beige to chocolate on Eric Meyer's color blender\" width=\"506\" height=\"494\" loading=\"lazy\" />\n<p>I used a shade that is just a bit lighter, and instead of charcoal or black I paired this with a color that reminded me of dark chocolate. I found I love my <a href=\"/type/\">type choices</a> even more in this understated palette. To get a few midpoints (colors for card components, supporting text, etc.) I used a classic web design tool, <a href=\"https://meyerweb.com/eric/tools/color-blend/\">Eric Meyer's Color Blender</a>. Link color matches text color this time, except links will always be underlined.</p>\n<p>With almost all blues eliminated in this new minimal palette, I thought it would be a good time to take stock of any CSS declarations I no longer needed and remove them. I used <a href=\"https://cssstats.com/\">cssstats.com</a> to audit these styles.</p>\n<figure>\n<a href=\"http://web.archive.org/web/20220807202952/https://cssstats.com/stats/?url=nicksimson.com\"><img src=\"/img/post-images/2022-css-color-stats.png\" alt=\"screenshot of CSS stats dot com\"  loading=\"lazy\"/></a>\n<figcaption>50 unique colors. 84 total color declarations. 44 unique background colors. 60 total background colors. (According to <a href=\"http://web.archive.org/web/20220807202952/https://cssstats.com/stats/?url=nicksimson.com\">cssstats.com</a>)</figcaption>\n</figure>\n<p>Wow, that’s a lot of color. When I started working on this site in 2020, I grabbed the whole <a href=\"http://tachyons.io/docs/themes/skins/\">tachyons palette</a>. I’m not sure what I was thinking at the time, perhaps I might be a little ambitious with a rainbow of different colors throughout my site. That didn’t really pan out, and so I was able to get rid of a big chunk of my <code>_config.scss</code> file, plus a bunch of color utility classes it turns out I wasn’t using at all.</p>\n<p>With my earlier implementation of dark mode, I also struggled a bit with how other user interface (UI) components should translate from light to dark. Should a card component be lighter or darker than the background color? What about <code>code</code> and <code>pre</code> elements? Does this relationship switch from one mode to another?</p>\n<p>Accessibility, as always is a primary concern. To get a range of values that are interoperable in both light and dark modes, I put some of <a href=\"https://meyerweb.com/eric/tools/color-blend/#F9F4EB:231C13:10:hex\">my color values from color blender</a> into EightShapes’ <a href=\"https://contrast-grid.eightshapes.com/?version=1.1.0&amp;background-colors=&amp;foreground-colors=%23ffffff%2C%20White%0D%0A%23f9f4eb%2C%20Ivory%0D%0A%23e6e0d7%2C%20LightGray%0D%0A%23aba59c%2C%20Gray%0D%0A%235d574e%2C%20MedGray%0D%0A%23433c33%2C%20DarkGray%0D%0A%23231c13%2C%20Black%0D%0A%23c11b11%2C%20DarkRed%0D%0A%23ee453b%2C%20BrandRed%0D%0A%23f18680%2C%20LightRed%0D%0A%23fac1bf%2C%20LightestRed&amp;es-color-form__tile-size=compact&amp;es-color-form__show-contrast=aaa&amp;es-color-form__show-contrast=aa&amp;es-color-form__show-contrast=aa18\">Contrast Grid tool</a>. I also added shades and tints of my red brand color, since I want a link style to stand out for certain links, like my <a href=\"/tags/\">post tags</a>. The contrast grid tool is one of my favorites. It allows you to test many foreground and background colors at once in compliances with WCAG 2.0’s minimum contrast requirements.</p>\n<figure>\n<a href=\"https://contrast-grid.eightshapes.com/?version=1.1.0&background-colors=&foreground-colors=%23ffffff%2C%20White%0D%0A%23f9f4eb%2C%20Ivory%0D%0A%23e6e0d7%2C%20LightGray%0D%0A%23aba59c%2C%20Gray%0D%0A%235d574e%2C%20MedGray%0D%0A%23433c33%2C%20DarkGray%0D%0A%23231c13%2C%20Black%0D%0A%23c11b11%2C%20DarkRed%0D%0A%23ee453b%2C%20BrandRed%0D%0A%23f18680%2C%20LightRed%0D%0A%23fac1bf%2C%20LightestRed&es-color-form__tile-size=compact&es-color-form__show-contrast=aaa&es-color-form__show-contrast=aa&es-color-form__show-contrast=aa18\"><img src=\"/img/post-images/2022-contrastgrid-earthtones.png\" alt=\"screenshot of accessible color combos in beige, brown and red\"  loading=\"lazy\"/></a>\n<figcaption>My latest color scheme, using EightShapes’ Contrast Grid</figcaption>\n</figure>\n<p>I wanted to make it easier on myself this time, using CSS variables again, and making the little UI decisions less <em>variable</em> themselves. In light mode, the “card” background will be a bit darker than the background color, and in dark mode, the “card” will be a bit lighter. In my current case, “card” styles are <code>div</code>s with a <code>.panel</code> class applied, plus the <code>blockquote</code>, <code>code</code> and <code>pre</code> elements. I am applying a strict rule to my internal brand guidelines not to mix these up too much. When I do (putting code samples in a blockquote for example), hopefully my type system sorts these out perceptively. Minimalism is harder than it looks!</p>\n<p>So to review, that’s six different values: a <code>body</code> background color, a “card” background color, a text color, a supporting (light) text color, a default link color (same as text color), and a hovered link color. Here’s those variables in action:</p>\n<pre>\n\n:root {\n  --bg-color: #faf6ef;\n  --bg-card: #e6e0d7;\n  --text-color: #433c33;\n  --light-text: #5d574e;\n  --link-color: #433c33;\n  --link-hover: #ee453b;\n}\n\n</pre>\n<p>And the colors for dark mode:</p>\n<pre>\n@media (prefers-color-scheme: dark) {\n    :root {\n        --bg-color: #231c13;\n        --bg-card: #433c33;\n        --text-color: #f9f4eb;\n        --light-text: #e6e0d7;\n        --link-color: #f9f4eb;\n        --link-hover: #f18680;\n      }\n}\n</pre>\n<p>I’ve found lately when working with CSS variables, and dark mode especially, that it is better to name classes and variables with the purpose of the color, rather than the color’s name. Now that I’m going down this road, there is probably a lot more in my stylesheets I can refactor, maybe embracing more repeatable utility classes for the different components that make up my site. It is always a work in progress.</p>\n<p>I hope you like the new color scheme as much as I do.</p>\n",
      "date_published": "2022-08-09T23:37:55Z"
    },{
      "id": "https://nicksimson.com/posts/2022-these-webfonts-do-not-track-you/",
      "url": "https://nicksimson.com/posts/2022-these-webfonts-do-not-track-you/",
      "title": "These webfonts do not track you",
      "content_html": "<p>For a while I have proudly displayed the following statement on my about page:</p>\n<blockquote>\n<strong>This website does not track you.</strong> There are no third-party cookies here, and your data isn’t collected when using this site.\n</blockquote>\n<p>As of this writing, I can feel more confident in this statement: <a href=\"https://github.com/nsmsn/nicksimsondotcom/commit/38d338c633451909fbbbdfd8437084fb15158a1c#diff-f934e43e0f8ddbcd51317189e847c41f190ec983462fc3bd7169b8d7f1a99cf6\">I switched from using the Google Fonts API</a> to hosting my font files on this domain.</p>\n<p>While I was catching up on some recent WordPress news, I learned that the themes team is now <a href=\"https://make.wordpress.org/themes/2022/06/18/complying-with-gdpr-when-using-google-fonts/\">recommending WordPress theme authors to bundle Google fonts</a> with the theme files. The impetus for this announcement was a German court ruling (earlier this year) that <a href=\"https://wptavern.com/german-court-fines-website-owner-for-violating-the-gdpr-by-using-google-hosted-fonts\">Google-hosted webfonts violate Europe's General Data Protection Regulation (GDPR)</a>.</p>\n<p>What it comes down to is that a person’s IP address can be exposed to Google just by them browsing a website using fonts hosted on Google’s CDN. On my personal website, I do not have a privacy policy more explicit than “I don’t want you to be tracked”—I want this site to comply with GDPR, the California Consumer Privacy Act, and any and all other present and future data privacy laws, regardless of where my visitors live.</p>\n<p>The Google fonts issue was news to me, but not surprising. Here’s why I did not know about it: I use the <a href=\"https://www.ghostery.com/\">Ghostery browser extension</a> for most of my web browsing and was relying on what that tool was reporting back to me. While Ghostery detects and blocks Google Analytics’ tracking scripts in everyday browsing, they apparently are unable to detect what a CDN could be collecting from you. And in addition to making your web browsing a little less pretty, blocking web fonts from rendering could also make entire web pages unusable if the web developer does not employ a <a href=\"https://www.zachleat.com/web/comprehensive-webfonts/\">font-loading strategy</a> or select appropriate fallbacks.</p>\n<p>Google can of course make this easier on everyone by not collecting the IP address of everyone who accesses fonts from their CDN, but they also make their font library (each typeface in the collection is open-source) easily available for download. So I initially followed <a href=\"https://gomakethings.com/how-to-self-host-google-fonts/\">Chris Ferdinandi’s instructions and advice</a> to use the <a href=\"https://google-webfonts-helper.herokuapp.com/fonts/\">Google Webfonts Helper app</a> to download the font files needed on my website.</p>\n<p>What Google’s own download feature  and the webfonts helper app won’t give you (as of this writing, Summer 2022) is the variable font files. This is a bit disappointing, since Google seems to have the best support for variable fonts, of all the typography services out there. <a href=\"https://developer.mozilla.org/en-US/docs/Web/CSS/CSS_Fonts/Variable_Fonts_Guide\">Variable fonts</a> are a relatively new technology that enables many different variations of a typeface to be incorporated into a single file, rather than having a separate font file for every width, weight, or style. A big reason why <a href=\"posts/2020-redesign-webfonts-html/\">I went with Google fonts with my redesign</a> was that I wanted to try out variable fonts on a production project.</p>\n<p>If you want to try hosting your own variable fonts from Google’s service, <a href=\"https://bnijenhuis.nl/notes/2021-04-13-how-to-add-self-hosted-variable-fonts-to-your-website\">Bernard Nijenhuis has an excellent post with some technical instructions</a>. Henry Desroches has an even more <a href=\"https://henry.codes/writing/how-to-convert-variable-ttf-font-files-to-woff2/\">technical tutorial on converting a variable TTF font file to WOFF2 format</a>. I did not need to refer to Henry's instructions. My two variable families are <a href=\"https://www.etceteratype.co/epilogue\">Epilogue</a> and <a href=\"https://www.type-together.com/literata-3\">Literata</a>, whose foundries have already made variable font file downloads available. From another <a href=\"https://github.com/jpamental/letter-from-birmingham-jail\">open source project by Jason Pamental</a>, I found a subsetted version of Literata that is a bit smaller in size from the files downloaded from TypeTogether's website.</p>\n<h2 id=\"alternatives-to-google-fonts\">Alternatives to Google Fonts <a class=\"direct-link\" href=\"#alternatives-to-google-fonts\">#</a></h2>\n<p>If you like using Google’s API, but want a more GDPR-friendly CDN for font delivery, you could also try <a href=\"https://fonts.bunny.net/\">fonts.bunny.net</a>. Bunny Fonts bills itself as a “drop-in replacement for Google Fonts”:</p>\n<blockquote class=\"flow\">\n<p>The Bunny Fonts API was designed to be fully compatible with the Google Fonts CSS v1 API, making the switch as easy as changing the hostname.</p>\n<p>Simply swap <code>\"https://fonts.bunny.net/css\"</code> in place of <code>\"https://fonts.googleapis.com/css\"</code> on your website's source code and let your users enjoy better privacy.</p>\n</blockquote>\n<p>The caveat to using Bunny Fonts is that you may not be able to use the variable versions of the Google Fonts library, at least at the time of this writing.</p>\n<p>If you are looking to self-host variable fonts, many of the best designed variable fonts on Google fonts are available to download on <a href=\"https://www.fontshare.com/\">Fontshare</a>, by the Indian Type Foundry (ITF). In addition to open source designs like <a href=\"https://www.fontshare.com/fonts/literata\">Literata</a> and <a href=\"https://www.fontshare.com/fonts/epilogue\">Epilogue</a>, there are many “closed source” designs by ITF that you can also use under a free license. I’m particularly drawn to <a href=\"https://www.fontshare.com/fonts/satoshi\">Satoshi</a>, <a href=\"https://www.fontshare.com/fonts/zodiak\">Zodiak</a>, and <a href=\"https://www.fontshare.com/fonts/general-sans\">General Sans</a>.</p>\n<h2 id=\"performance-considerations\">Performance Considerations <a class=\"direct-link\" href=\"#performance-considerations\">#</a></h2>\n<p>The <code>@font-face</code> declaration in CSS is not new technology—it was introduced in 1998. Browser support and font file specifications, however, varied a bit for at least a decade. Frankly, <a href=\"https://thehistoryoftheweb.com/web-fonts/\">it was a tangled mess until 2009</a>, when font hosting services like Typekit emerged to take the technical complexity out of web designers’ hands and make licensing simpler for the foundries producing type families. After studying typography in a traditional graphic design program in the mid-to-late 2000s, I was really excited to start designing for the web again when Typekit (now <a href=\"https://fonts.adobe.com\">Adobe Fonts</a> came out, having access to a range of expressive and well-designed typefaces.</p>\n<p>Even with wide browser support for <code>@font-face</code>, it took years for browsers to implement a standard webfont file format: Files with <code>.eot</code> extensions were used for Internet Explorer versions before IE 10; Safari, Android and iOS used <code>.ttf</code> files; the oldest versions of iOS that supported webfonts used <code>.svg</code> format. Services like Typekit and Google Fonts supported all these web font versions and let you connect to a CSS or Javascript file to make sure the right file reached your audience’s browsers.</p>\n<p>In a technical post, <a href=\"https://www.tunetheweb.com/blog/should-you-self-host-google-fonts/\">Barry Pollard breaks down the many performance benefits</a> of self-hosting Google fonts. Nowadays, modern browsers all support the <code>.woff</code> format, and better compression is available with <code>.woff2</code>. With less complexity in file types and HTTP/2 available on web servers you <em>might not</em> need a CDN, or experience performance benefits from hosting assets on a CDN.</p>\n<p>I have not completely given up on Google. I am using their <a href=\"https://pagespeed.web.dev/\">page speed insights tool</a> to figure out how I can continue to optimize my site for performance, while still displaying great typography. With <a href=\"https://docs.microsoft.com/en-us/lifecycle/announcements/internet-explorer-11-end-of-support\">Internet Explorer officially sunsetted this summer</a>, I think I may be able to drop <code>.woff</code> [version 1] support and only host <code>.woff2</code> files. It’s a tricky balance since I’m not using analytics to find out which browsers are viewing my site. But I am already using <code>font-display: swap;</code> as my font loading strategy and treating the fonts themselves as progressive enhancement may be the way to go, at least for me personally. Almost 30 years later, <a href=\"https://en.wikipedia.org/wiki/Georgia_(typeface)\">Matthew Carter’s Georgia</a> is still a great design, and very legible.</p>\n<p>I am currently exploring repos of various developers I look up to, to see how they are delivering their webfonts, variable and otherwise. If you have ideas for improving my web font performance, you can <a href=\"mailto:nick@nicksimson.com\">email me</a> about this. I’d love to hear how you are implementing self-hosted and variable typography.</p>\n",
      "date_published": "2022-07-03T01:08:13Z"
    },{
      "id": "https://nicksimson.com/posts/2022-writing-a11y-statement/",
      "url": "https://nicksimson.com/posts/2022-writing-a11y-statement/",
      "title": "Adding an accessibility statement",
      "content_html": "<p>With the latest deployment of this website, you should be able to see a link labeled “Accessibility” in the <code>footer</code>. This will take you to my <a href=\"/accessibility/\">accessibility statement</a>. This is important to me for a few reasons:</p>\n<ul>\n<li>I tried to make all the features and content on my site as accessible as I know how to do. I want my users to know I care about them.</li>\n<li>I want people who work with me to understand the importance of digital accessibility and my commitment to ongoing learning and social responsibility.</li>\n<li>If there are errors or accessibility issues on my site, I need to know about them so I can go about fixing them as quickly as possible.</li>\n</ul>\n<p>It’s far more common to see accessibility statements where they may be legally required, such as large corporations, governments, and education websites. I have noticed a few people I look up to include statements on their personal sites, and I’ve linked to them on my own page. I hope this is a trend that continues!</p>\n<p>When I set out to <a href=\"/posts/2020-newww-year/\">redesign my site in December 2020</a>, providing an accessible experience was top of mind. With every new feature and page I add to my website, I consider accessibility and do my best to address it.</p>\n<p>Often times this looks like running a URL through an automated accessibility checker. I personally love browser-based tools, and my longtime favorites are <a href=\"https://wave.webaim.org\">WAVE</a> and <a href=\"https://tenon.io/\">Tenon</a>. These tools are good, and it’s fun or challenging to get a “score”. But they’re only capable of catching <a href=\"https://marcysutton.com/evinced-automated-accessibility-testing\">30-50% of accessibility issues on a page</a>, so it’s important to do some manual checks.</p>\n<p>I <a href=\"https://github.com/nsmsn/nicksimsondotcom/commit/929d7530e076763228f86a0775178f3b530688bb\">fixed an issue</a> recently on my <a href=\"/library/\">Library page</a>, when I discovered redundant alt text on linked images. In this case, I had both a book cover image and book title linked and going to the same destination, and I was using the book title as the image’s <code>alt</code> attribute. I was trained to always use alt text on a linked image, but in this case if there is text in the link describing the link destination, it is OK to use an empty <code>alt=&quot;&quot;</code>. <a href=\"https://blog.pope.tech/2020/03/13/linked-image-missing-alternative-text-example/\">Pope Tech has a great blog post on this</a>, using an image card component as an example.</p>\n<p>An accessibility statement is not going to prevent me from running into issues like this, but it does communicate my dedication to fixing these things as I discover them. I also included two ways my audience can report accessibility issues or barriers to me. Finally, I thought it was important to state that I am always learning new things about digital accessibility and will share what I learn.</p>\n",
      "date_published": "2022-05-30T11:23:57Z"
    },{
      "id": "https://nicksimson.com/posts/2022-ditch-twitter/",
      "url": "https://nicksimson.com/posts/2022-ditch-twitter/",
      "title": "Ditch Twitter. And Instagram. And Goodreads.",
      "content_html": "<p>In a 2014 essay called <a href=\"http://incisive.nu/2014/ditching-twitter/\">Ditching Twitter</a>, Erin Kissane wrote about her personal dissatisfaction with the social network. The issues with the platform she diagnosed seven-plus years ago are still there. I keep coming back to this essay since it is about making something imperfect, broken even, work somehow for you.</p>\n<blockquote>\n<p>It took me a few weeks of feeling quietly glum about losing Twitter before I remembered that I know a few things about streams, and ditches. And beyond that, that figuring out how to make better use of communication systems is kinda what I’ve been doing for a living for a decade or so.</p>\n</blockquote>\n<p>I’ve taken hiatuses from Twitter before, the longest being a period between August 2019 and December 2020. And I found I wasn’t missing much. If something big happened on Twitter, I still managed to find out about it somehow. I eventually lost the urge to check or refresh the timeline. The goings-on inside Twitter the company, and the dynamics and drama of posting occupied less and less space in my brain.</p>\n<p>If you came here looking for my take on Elon Musk, it is this: I tend not to trust people with great wealth. Based on his public persona, I percieve Musk as a troll, a clown, and a self-promoter. As far as Musk’s acquisition and transformation of Twitter into a private company, I will adopt a wait-and-see approach. But my expectations are not high.</p>\n<p>Instead of creating data that makes more money for Musk, Zuckerberg, Bezos, and others like them, <strong>I’d like to make the web itself my social network</strong>. I think I found a service that takes steps toward making that happen.</p>\n<figure>\n    <blockquote cite=\"https://kimberlyhirsh.com/2022/04/25/microblog-is-a.html\">\n        <a href=\"https://micro.blog\">Micro.blog</a> is a free social network if you blog elsewhere and plug in a feed. It can also host your blog/website for $5/mo. For $10/mo, it will host your blog/website, host your podcast (audio or video), replace Instapaper/Pocket, and replace GoodReads.\n       </blockquote>\n    <figcaption>— Kimberly Hirsch, on <cite><a href=\"https://kimberlyhirsh.com/2022/04/25/microblog-is-a.html\">her website (also on Micro.blog)</a></cite></figcaption>\n</figure>\n<p>The gist of microblogging is short-form posts. Micro.blog status posts even make use the same 280 character limit. Unlike Twitter, once you break that character limit, a(n optional) title field appears. Through the magic of <a href=\"https://www.markdownguide.org\">Markdown</a>, rich text formatting is available in your posts. You can include a photo or image with your post, and like Twitter and Instagram, you can add alt text to your images.</p>\n<figure>\n    <blockquote cite=\"https://book.micro.blog/introduction/\">\n        Big platforms like Twitter, Facebook, Instagram, and TikTok are built  with small pieces of content. Lack of friction made posting easy.  Amplification and engagement made creators influential. Native ads that  are the same size as real content made platforms rich. That’s why the  fix should also be rooted in small (micro) content: where it’s stored,  who owns it, and how it flows across the web between much smaller, open  platforms.\n       </blockquote>\n    <figcaption>— Manton Reece, <cite><a href=\"https://book.micro.blog/introduction/\">Indie Microblogging: Introduction</a></cite></figcaption>\n</figure>\n<p>Micro.blog is designed to be more <em>decentralized</em> than other major social networks. It uses of some vital web technologies that make it easy to import, export and syndicate your content from different platforms. If posting to Twitter is still important to you, you can syndicate your micro.blog to post to Twitter. If you have another site with a RSS or JSON feed, you can bring that feed into your microblog. You can also move content from another blogging service like  WordPress, Ghost or Tumblr. If you decide you no longer want to keep your content on the Micro.blog platform you can export all your content, replies, theme and other data easily. There's even a way to regularly <a href=\"https://help.micro.blog/t/archiving-to-github/58\">archive your Micro.blog to a GitHub repository</a>.</p>\n<p>I am currently using the 10-day free trial to try all these features out. I created a separate blog for notes as a brief experiment with WordPress last fall and imported those posts using an XML file. It went very smoothly, save for the [youtube] shortcode that WordPress uses for the video embed block. I was able to <a href=\"https://help.micro.blog/t/copying-photos-to-micro-blog-from-instagram/78\">import photos and captions from my Instagram account</a> (after requesting a download of my data from Meta/Instagram) using the MacOS app. The <a href=\"https://help.micro.blog/t/bookshelves/515/13\">bookshelves feature</a> is a very basic Goodreads alternative. I found it relatively easy to export my Goodreads data into a .csv file and imported this into my Micro.blog account under Bookshelves. The import worked relatively quickly and uses ISBN data to find books in the Micro.blog <a href=\"https://micro.blog/discover/books/grid\">book database</a>.</p>\n<p>If you’re curious to see what this all looks like, you can check out <a href=\"http://micro.blog/nsmsn\">my timeline on Micro.blog</a> or visit <a href=\"https://log.nicksimson.com\">log.nicksimson.com</a></p>\n<h2>Platform and Community</h2>\n<p>While you can use Micro.blog to syndicate to Twitter, <a href=\"https://help.micro.blog/t/what-s-the-difference-between-micro-blog-and-twitter/21\">Micro.blog is not a Twitter replacement</a>. You have no insight into who is following you, or the follower counts of any user on the platform. If you are logged in, you can see who other people are following. There is also no support for #hashtags, and no like or retweet buttons. You can of course link to someone else’s post. If you like what someone else has posted, you are encouraged to post a polite, thoughtful reply.</p>\n<figure>\n    <blockquote cite=\"https://blog.ayjay.org/a-bit-of-advice/\">\n        On Micro.blog, you have absolutely no incentive to flex, shitpost, self-promote, or troll. You’re there to post interesting things and/or chat with people. Nothing else makes sense.\n       </blockquote>\n    <figcaption>— Alan Jacobs, <cite><a href=\"https://blog.ayjay.org/a-bit-of-advice/\">a bit of advice for those who are coming to Micro.blog from Twitter</a></cite></figcaption>\n</figure>\n<p>Micro.blog has posted clear <a href=\"https://help.micro.blog/t/community-guidelines/39\">community guidelines</a> and states that they are committed to maintaining a safe community for its users. Micro.blog is small enough to have a <a href=\"https://micro.blog/discover\">Discover timeline</a> that is mostly human-curated, with it’s own <a href=\"https://help.micro.blog/t/using-the-discover-timeline-and-categories/40\">set of guidelines</a>. Instead of using hashtags, posts about specific topics (music, TV, knitting, gardening, cats, dogs, sports, etc.) are automatically put into <a href=\"https://help.micro.blog/t/emoji-in-discover/34\">specific timelines using emoji</a>. After using this for a few days, the overall vibe is mostly positive, inviting, even <em>wholesome</em> at times. I am not sure who the wealthiest or most famous person is on Micro.blog, nor do I care. I haven’t found a politician on this platform yet.</p>\n<h2>Going forward</h2>\n<p>For the time being, I am going to use <a href=\"https://log.nicksimson.com/\">my microblog</a> to keep track of the books I’m reading, publish my public notes, and for other things I find useful. I’ll also post the occasional photo or two. This will be my go-to social network.</p>\n<p>After downloading my Goodreads data, I deleted my account. I’m no longer interested in sending data on the books I read to Amazon. I put the RSS feeds for the handful of people I followed on Goodreads into my RSS reader, so I can keep up with their books. For now, I’m keeping my <a href=\"https://literal.club/nsmsn\">Literal account</a>, but Micro.blog can easily replace that too.</p>\n<p>Similarly, I am not interested in sharing my photos or life updates with the advertising company Meta. Now that they are all moved over to my microblog, I archived the posts on my <a href=\"https://www.instagram.com/n.smsn/\">Instagram account</a> (but kept up the link to my personal website). I might open the Instagram app once or twice a month to see what my friends, favorite artists, and cute animals are up to.</p>\n<p>In spite of the platform’s issues, Twitter can still be a useful place. I find myself learning things from accounts I follow and what they post or retweet—especially the folks using the <a href=\"https://twitter.com/hashtag/a11y\">#a11y hashtag</a>. I’ve used the service to authenticate a few other accounts and still use it to sign in to a few websites. I blocked @elonmusk. So I’m keeping my Twitter account up, for now, mainly to link back to my own personal site, and to stay engaged with the parts that are still useful to me. If it takes a turn for the worse, I’m ready to bail.</p>\n",
      "date_published": "2022-05-01T20:18:23Z"
    },{
      "id": "https://nicksimson.com/posts/2022-lullabies/",
      "url": "https://nicksimson.com/posts/2022-lullabies/",
      "title": "Lullabies",
      "content_html": "<p>I’m a dad! <a href=\"https://eleanoraldrich.com\">Eleanor</a> and I welcomed the arrival of our first child. Witnessing her birth was the most amazing experience and we’re thankful for a safe delivery and healthy baby.</p>\n<figure>\n<img src=\"/img/post-images/2022-parenthood.jpg\" alt=\"A tired looking man holds an infant wrapped in a hospital blanket\" />\n<figcaption>My first time holding our daughter</figcaption></figure>\n<p>I’m taking several weeks off work (thankfully I am among the 26 percent of public sector workers in the U.S. with paid family leave) to get to know this tiny person. There’s so much to soak in right now and so much more to look forward to.</p>\n",
      "date_published": "2022-03-13T00:00:00Z"
    },{
      "id": "https://nicksimson.com/posts/2021-in-books/",
      "url": "https://nicksimson.com/posts/2021-in-books/",
      "title": "Books finished in 2021",
      "content_html": "<p>In 2021 I managed to complete more fiction titles, including the Pynchon and Murakami books I started last year.</p>\n<p>As always, this is not a list of endorsements—just an honest list of books I consumed last year.</p>\n<p>Guide:<br>\n⭐ Endorsement<br>\n📖 Read hardcover or paperback<br>\n📱 Read as ebook or PDF<br>\n🎧 Listened to audiobook</p>\n<ol>\n<li>\n<p><i>Heaven and Hell: A History of the Afterlife </i><br>\nby Bart D. Ehrman<br>\n🎧 <small>Finished on <time datetime=\"2021-01-05\">January 5</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Begin Again: James Baldwin's America and Its Urgent Lessons for Our Own </i>⭐<br>\nby Eddie S. Glaude<br>\n🎧 <small>Finished on <time datetime=\"2021-01-21\">January 21</time></small><br>\n </p>\n</li>\n<li>\n<p><i>The Short Life and Curious Death of Free Speech in America </i><br>\nby Ellis Cose<br>\n🎧 <small>Finished on <time datetime=\"2021-01-25\">January 25</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Why You Should Be a Socialist</i><br>\nby Nathan J. Robinson<br>\n🎧 <small>Finished on <time datetime=\"2021-01-26\">January 26</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Black Reconstruction in America </i>⭐<br>\nby W.E.B. Du Bois<br>\n🎧 <small>Finished on <time datetime=\"2021-02-26\">February 26</time></small><br>\n </p>\n</li>\n<li>\n<p><i>How to be Depressed</i><br>\nby George Scialabba<br>\n📱 <small>Finished on <time datetime=\"2021-02-28\">February 28</time></small><br>\n </p>\n</li>\n<li>\n<p><i>The Dispossessed</i><br>\nby Ursula K. Le Guin<br>\n🎧 <small>Finished on <time datetime=\"2021-03-19\">March 19</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Debt: The First 5,000 Years </i>⭐<br>\nby David Graeber<br>\n🎧 <small>Finished on <time datetime=\"2021-04-27\">March 19</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Searching for Woody Guthrie</i><br>\nby Ron Briley<br>\n📖 <small>Finished on <time datetime=\"2021-04-30\">April 30</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Collected Essays </i>⭐<br>\nby James Baldwin<br>\n📖 <small>Finished on <time datetime=\"2021-05-02\">May 2</time></small><br>\n </p>\n</li>\n<li>\n<p><i>The Stowaway: A Young Man's Extraordinary Adventure to Antarctica</i><br>\nby Laurie Gwen Shapiro<br>\n🎧 <small>Finished on <time datetime=\"2021-06-24\">June 24</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Man's Search for Meaning</i><br>\nby Viktor E. Frankl<br>\n🎧 <small>Finished on <time datetime=\"2021-06-26\">June 26</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Wabi-Sabi: For Artists, Designers, Poets &amp; Philosophers </i><br>\nby Leonard Koren<br>\n📱 <small>Finished on <time datetime=\"2021-07-05\">July 5</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Black Buck</i><br>\nby Mateo Askaripour<br>\n🎧 <small>Finished on <time datetime=\"2021-08-27\">August 27</time></small><br>\n </p>\n</li>\n<li>\n<p><i>A Man Without a Country</i><br>\nby Kurt Vonnegut<br>\n🎧 <small>Finished on <time datetime=\"2021-08-29\">August 29</time></small><br>\n </p>\n</li>\n<li>\n<p><i>All Joy and No Fun: The Paradox of Modern Parenthood</i><br>\nby Jennifer Senior<br>\n🎧 <small>Finished on <time datetime=\"2021-09-04\">September 4</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Interior Chinatown</i><br>\nby Charles Yu<br>\n🎧 <small>Finished on <time datetime=\"2021-09-07\">September 7</time></small><br>\n </p>\n</li>\n<li>\n<p><i>The Arrest</i><br>\nby Jonathan Lethem<br>\n🎧 <small>Finished on <time datetime=\"2021-09-15\">September 15</time></small><br>\n </p>\n</li>\n<li>\n<p><i>The Wind-Up Bird Chronicle </i><br>\nby Haruki Murakami<br>\n🎧 <small>Finished on <time datetime=\"2021-10-13\">October 13</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Mason and Dixon</i>⭐<br>\nby Thomas Pynchon<br>\n📱 <small>Finished on <time datetime=\"2021-11-16\">November 16</time></small><br>\n </p>\n</li>\n</ol>\n",
      "date_published": "2022-01-02T00:00:00Z"
    },{
      "id": "https://nicksimson.com/posts/2021-boone/",
      "url": "https://nicksimson.com/posts/2021-boone/",
      "title": "Boone",
      "content_html": "<p>After he moved out west, he tried going by “Ed”. Back east, Ed was his dad’s name and all family, close friends, and everyone he grew up with knew him as Boone. My sister and I called him Dad.</p>\n<p>He was born Edward Boone Simson on February 5, 1960. Dad was raised by a Baptist from New York (Ed) and a Methodist from Oklahoma (Ina). He was the second youngest of eight kids.</p>\n<p>I woke up this morning to a phone call from Mom telling me that Dad died late last night or early this morning. I could not believe it. It’s still hard to process. He was gone, so suddenly. No last goodbyes.</p>\n<p>My parents grew up in the <a href=\"https://en.wikipedia.org/wiki/Oneida,_New_York\">same town</a> in Central New York. After a brief stint in Rochester, they moved back and bought my great grandfather’s house. They brought us up in the church and were often enlisted to be church musicians, playing guitar (Dad) and piano (Mom). Dad’s first career was a salesman, working as a store manager, then a traveling sales rep. For much of my childhood he worked from an office in our home. Our school was closed for all federal holidays, but Dad had to work on some of those days. He said he was going to take me to work with him on one of those holidays and surprised me by taking me to the Baseball Hall of Fame in Cooperstown.</p>\n<p>In his 40s he moved our family from the Rust Belt to the <a href=\"https://en.wikipedia.org/wiki/Maricopa_County,_Arizona\">Sun Belt</a>. He got his insurance license in the 2010s and then worked for McKesson, Inc. for the last several years. Dad was looking forward to retiring and meeting his grandchildren. My sister just gave birth in September. Eleanor and I are expecting in March. We were all <a href=\"https://log.nicksimson.com/off-the-deep-end/\">trying to convince</a> Mom and Dad to get the COVID-19 vaccine.</p>\n<p>Dad’s passions were songwriting and home improvement. He started writing songs in the 1980s and recorded 11 tracks to compact disc in 2015. He gave me his Martin D12-20 a few years ago. My parents dowsized and moved to a neighborhood for people 55 and older. Dad wanted to be a handyman and help his older neighbors with their leaky faucets. He was a huge help to me when we bought our first home in 2018, and I wish I had more time with him to learn some more things.</p>\n<p>Dad had a sense of humor and was great at making kids laugh. With adults he was adept at finding levity in all situations. I always took pride in being able to elicit an uncontrollable belly laugh from him with one of my wry comments. I inherited some of his stubbornness. Dad and I did not share the same politics, but he did say he was proud of me for getting involved in <a href=\"https://justiceknox.org/\">justice work</a>.</p>\n<p>Dad loved Arizona’s mountains and deserts. He loved his kids and was proud of us. There’s plenty more I could write about him, as well as some stuff I don’t want to air publicly. I can’t believe he’s gone.</p>\n",
      "date_published": "2021-11-09T00:00:00Z"
    },{
      "id": "https://nicksimson.com/posts/2021-redesign-dark-mode/",
      "url": "https://nicksimson.com/posts/2021-redesign-dark-mode/",
      "title": "Now with dark mode",
      "content_html": "<p>If your device supports a dark mode, and you’ve set this as your preference, you can now view my website in a darker color scheme. I worked on it this weekend during an <a href=\"https://events.indieweb.org/2021/10/indieweb-create-day-ZKw5v2nFDu6f\">IndieWeb Create Day</a>—one day dedicated to working on our personal websites or various IndieWeb projects out in the open.</p>\n<figure>\n    <img src=\"/img/post-images/2021-10-lightmode-darkmode.jpg\" class=\"panel\"\n         alt=\"NickSimson dot com slash info\" />\n    <figcaption>My info page in both light mode and dark mode</figcaption>\n</figure>\n<p>I launched my site with an off-white background, so the &quot;light mode&quot; design will be my default design. Adding dark mode support is pretty straightforward. There is a media query for dark color scheme preference:</p>\n<pre>\n\n@media (prefers-color-scheme: dark) {\n    \n    */ Write your dark mode styles here /*\n\n  }\n\n</pre>\n<p>Within that rule you can write in any overrides you desire. The complexity is going to depend on how your CSS is structured. I’m using Sass on <a href=\"http://nicksimson.com\">nicksimson.com</a>, and I have several places where I am declaring colors. First, I have a <code>_config.scss</code> file where I have fonts, colors, and sizes declared as Sass variables. The colors are named things like <code>$darkblue</code> and <code>$lightyellow</code>.</p>\n<p>Throughout my various <code>.scss</code> files I have colors applied to the <code>body</code>, base elements like <code>h1</code>, and classes like <code>.post-tag</code>.</p>\n<p>To get started, I fired up Eleventy and localhost, set my OS preferences to dark mode, and created a new <code>_darkmode.scss</code> file. I started writing a few rules on <code>body</code> to see how the browser rendered my site. The easiest place for me to start was to swap the text color and background color:</p>\n<pre>\n\n@media (prefers-color-scheme: dark) {\n    \n    body {\n        background: $darkgray;\n        color: $ivory;\n    }\n\n  }\n\n</pre>\n<p>This base rule quickly shows how many places where you may need to adjust colors to fix contrast issues. My <code>$darkblue</code> hyperlinks for example, started to disappear into the background. I already have a <a href=\"/html\">page that displays every html element</a> so I used this to quicky diagnose other elements to override. My site is not minimal in that it uses white black and blue. I have supporting text in medium gray, I apply subtle background colors to elements like <code>pre</code> and <code>code</code>, not to mention classes like <code>.post-tag</code> and <code>.panel</code>. When you highlight text on my site, it applies a high contrast highlight color scheme, so another thing I needed to override too.</p>\n<p>Remember how I said I had several classes in several <code>.scss</code> files applying color rules? For organizations sake it makes more sense to include the dark mode overrides in each file, rather than putting all these random elements and classes in one file. At the same time I didn't want to have to add the media query after every rule that apllied a color in the stylesheet.</p>\n<h2 id=\"css-variables-to-the-rescue\">CSS variables to the rescue <a class=\"direct-link\" href=\"#css-variables-to-the-rescue\">#</a></h2>\n<p>From a couple dozen colors declared in my config file, I narrowed down the big five that make up my core color scheme. I wrote these values as CSS variables on the <code>root</code> element, named by purpose instead of color value. These are background color, text color, light text (heading levels 5 and 6 plus supporting text like <code>figcaption</code>), link color and link hover color.</p>\n<pre>\n\n:root {\n  --bg-color: #faf9f9;\n  --text-color: #343434;\n  --light-text: #676767;\n  --link-color: #334492;\n  --link-hover: #ee453b;\n}\n\n</pre>\n<p>This involved changing some rules from Sass variables to these new CSS variables, like on the body element for example:</p>\n<pre>\n\nbody {\n  background-color: var(--bg-color);\n  color: var(--text-color);\n}\n\n</pre>\n<p>Going back to my <code>_darkmode.scss</code> file, I erased my body rules and changed these root colors within the dark mode media query:</p>\n<pre>\n@media (prefers-color-scheme: dark) {\n    :root {\n        --bg-color: #343434;\n        --text-color: #faf9f9;\n        --light-text: #c0c0c0;\n        --link-color: #a4bfeb;\n        --link-hover: #f18680;\n      }\n  }\n</pre>\n<p>This covers most of my dark mode needs. Beyond these variables, I am still including dark mode overrides on other <code>.scss</code> files, at the end of each stylesheet. There are only a few of these, and again they are on files like <code>_panel.scss</code> and <code>_tags.scss</code>.</p>\n<p>It only took a few hours and it was fun to share my work at the end of the day on Zoom with a few others in the IndieWeb community. Now I’m happy to share it with the world.</p>\n",
      "date_published": "2021-10-10T00:00:00Z"
    },{
      "id": "https://nicksimson.com/posts/2021-commonplace-books/",
      "url": "https://nicksimson.com/posts/2021-commonplace-books/",
      "title": "Commonplace books, gardens, and streams",
      "content_html": "<p>Earlier this summer I discovered that the <a href=\"https://events.indieweb.org/\">Homebrew Website Club</a> is meeting each week virtually. Due to my time zone and work schedule, I’ve only been able to attend a few club meetings so far. I’ve found it to be a great chance to stay up late and meet other folks passionate about the web, sharing what we’re working on, as well as sources of inspiration.</p>\n<p>The <a href=\"https://events.indieweb.org/2021/09/homebrew-website-club-the-americas-KTJy7nR6Xe8V\">September 1</a> meeting opened with about 20 minutes of quiet writing time, mainly to generate topics of discussion for the evening. I ended up sharing <a href=\"https://piperhaywood.com/\">Piper Haywood’s website</a> and her open source <a href=\"https://github.com/piperhaywood/commonplace-wp-theme\">Commonplace WordPress theme</a>, two links I discovered during the past weekend.</p>\n<p>I stumbled on Piper’s site after seeing the work she did on <a href=\"https://gemmacope.land/\">Gemma Copeland’s site</a>, powered by <a href=\"https://11ty.dev\">Eleventy</a> and <a href=\"http://Are.na\">Are.na</a>. Piper has kept her own site as a personal notebook since 2014. I’m especially drawn to the way her site handles an <a href=\"https://piperhaywood.com/archive/\">archive template</a> as well as <a href=\"https://piperhaywood.com/index/\">displaying tags as an index</a>.</p>\n<p>Wanting to learn more, I quickly found <a href=\"https://piperhaywood.com/commonplace-wordpress-theme/\">Piper’s</a> and <a href=\"https://log.becworth.info/what-could-a-commonplace-book-feel-like-on-the-web/\">Bec Worth’s</a> posts about commonplace books, a concept that until this week was new to me.</p>\n<figure>\n <blockquote>\n  <p>Paraphrasing the <a href=\"https://en.wikipedia.org/wiki/Commonplace_book\">Wikipedia entry</a>, Commonplace Books have been used since antiquity as an aid for remembering useful concepts or facts. They are inherently unique to their author and contain, but are not limited to recipes, quotes, letters, poems, tables of weights and measures, proverbs, prayers, legal formulas, observations and definitions. Unlike a diary or journal, they are not chronological or introspective, though some entries may include personal responses. Rather, entries are organised according to subject.</p>\n</blockquote>\n<figcaption><footer>- Bec Worth, <cite>\"<a href=\"https://log.becworth.info/what-could-a-commonplace-book-feel-like-on-the-web/\">What could a Commonplace Book feel like on the web?</a>\"</cite></footer></figcaption>\n</figure>\n<p><a href=\"https://nicksimson.com/posts/2021-engine-building-garden/\">I’m a big fan of personal websites</a> and the creative expression and quality of <em>thinking in public</em> they have always brought to the web. So I was delighted to discover a historical thread—a centuries-old practice being made digital with the added power of metadata and URLs!</p>\n<p>Other longtime Homebrew attendees were quick to point out that IndieWeb community members have widely <a href=\"https://indieweb.org/commonplace_book#IndieWeb_examples\">embraced the term</a>. Someone mentioned <a href=\"https://boffosocko.com/\">Chris Aldrich</a>, who refers to his site as a commonplace book and uses a <a href=\"https://boffosocko.com/tag/commonplace-books/\">commonplace books tag</a>, with more historical and contemporary examples. As it turns out there is an <a href=\"https://indieweb.org/commonplace_book\">IndieWeb wiki entry on the commonplace book</a>, where Piper Haywood herself is quoted:</p>\n<blockquote>\n“The best personal blogs I’ve come across feel like a glimpse in to someone’s personal notebook, something filled mostly with notes written with the author in mind first and foremost vs notes that have been written with a wider audience in mind.”\n</blockquote>\n<p>Lesson learned: Always consult the wiki. The phrase <em>digital gardens</em> also pops up often in the wiki entry on commonplace books. There is some question whether the two concepts should be used interchangably.  Whatever the name or taxonomy, the contours of this kind of site are shaped around <em>discovery</em> and letting ideas germinate. I’m totally on board for more of this.</p>\n<p>Some other wonderful examples:</p>\n<ul>\n<li><a href=\"https://maggieappleton.com/\">Maggie Appleton’s digital garden</a></li>\n<li><a href=\"https://notes.andymatuschak.org/About_these_notes\">Andy Matuschak’s evergreen notes</a></li>\n<li><a href=\"https://tomcritchlow.com/wiki/\">Tom Critchlow’s wiki</a> (be sure to check out <a href=\"https://tomcritchlow.com/2019/02/17/building-digital-garden/\">his blog post</a> too)</li>\n<li><a href=\"https://www.gwern.net/index\">Gwern Branwen’s website</a></li>\n<li>Ane-Laure Le Cunff’s <a href=\"https://www.mentalnodes.com/about\">Mental Nodes</a></li>\n<li>Aaron Z. Lewis’ <a href=\"https://aaronzlewis.com/blog/\">blog</a> and <a href=\"https://aaronzlewis.com/cocoon/\">cocoon</a></li>\n<li>Buster Benson’s <a href=\"https://notes.busterbenson.com/\">notes</a> and <a href=\"https://notes.busterbenson.com/piles\">piles</a></li>\n</ul>\n<p>IndieWebCamp is hosting a <a href=\"https://events.indieweb.org/2021/09/gardens-and-streams-ii-pPUbyYME33V4\">'Gardens and Streams' virtual event</a> on Saturday Sept. 25. I'm going to try to hop on and listen in for at least part of the day. If you are building a personal site for yourself or are curious about digital gardens and commonplace books, you should plan to attend!</p>\n",
      "date_published": "2021-09-04T00:00:00Z"
    },{
      "id": "https://nicksimson.com/posts/2021-favorite-utility-classes/",
      "url": "https://nicksimson.com/posts/2021-favorite-utility-classes/",
      "title": "My six favorite utility classes",
      "content_html": "<p>My approach to writing CSS these days lays somewhere in between Andy Bell’s <a href=\"https://cube.fyi/\">CUBE CSS</a> and Harry Roberts’ <a href=\"https://www.xfive.co/blog/itcss-scalable-maintainable-css-architecture/\">ITCSS</a>. I prefer Andy’s definition of a utility class from the CUBE CSS docs:</p>\n<blockquote>\nA utility, in the context of CUBE CSS, is a CSS class that does one job and does that one job well.\n</blockquote>\n<p>I’m writing this post to keep track of all of my favorite utilities–things I find myself reusing in almost every project.</p>\n<h2 id=\"visually-hidden\">Visually Hidden <a class=\"direct-link\" href=\"#visually-hidden\">#</a></h2>\n<pre>\n<code>\n.vis-hidden {\n    border: 0;\n    clip: rect(0 0 0 0);\n    height: auto;\n    margin: 0;\n    overflow: hidden;\n    padding: 0; \n    position: absolute;\n    width: 1px;\n    white-space: nowrap;\n  }\n</code>\n</pre>\n<p>If you ever used Bootstrap, you may recognize this as the <code>sr-only</code> class—in which sr stands for screen reader. I learned something from <a href=\"https://melanie-richards.com/blog/learning-log-2106/\">Melanie Richards’ recent learning log</a> and am using the <code>vis-hidden</code> class name from now on:</p>\n<blockquote>\nThis content is visually hidden; screen readers are not the only assistive tech that can access the hidden text on behalf of the user.\n</blockquote>\n<h2 id=\"uppercase-text\">Uppercase Text <a class=\"direct-link\" href=\"#uppercase-text\">#</a></h2>\n<pre>\n<code>\n.text-uppercase {\n    text-transform: uppercase;\n    letter-spacing: 1px;\n}\n</code>\n</pre>\n<p>When you want something displayed in all capital letters, but you need <a href=\"https://blogs.lanecc.edu/webteam/2017/03/07/using-all-capital-letters/\">assistive technology to read it predictably</a>. Adding in a little bit of letter spacing makes it a little easier to read a word set in all caps.</p>\n<h2 id=\"circular-images\">Circular Images <a class=\"direct-link\" href=\"#circular-images\">#</a></h2>\n<pre>\n<code>\n.img-circle {\n    border-radius: 50%;\n}\n</code>\n</pre>\n<p>This is great, whether you need a circular image for a user's avatar or in an &quot;art-directed&quot; post.</p>\n<h2 id=\"flex-objects\">Flex Objects <a class=\"direct-link\" href=\"#flex-objects\">#</a></h2>\n<pre>\n<code>\n.flexo {\n    display: flex;\n    flex-wrap: wrap;\n    margin: -0.5em;\n  }\n  \n  .flexo > * {\n    flex: 1 0 18em;\n    margin: 0.75em;\n  }\n</code>\n</pre>\n<p>A G-rated version of Heydon Pickering’s &quot;<a href=\"https://github.com/Heydon/fukol-grids\">Fukol Grid</a>&quot;. Turns anything nested in a <code>div</code> with a class of <code>flexo</code> into a flexible object (<a href=\"https://codepen.io/nsmsn/pen/yodeeo\">View demo</a>).</p>\n<h2 id=\"unstyled-list\">Unstyled List <a class=\"direct-link\" href=\"#unstyled-list\">#</a></h2>\n<pre>\n<code>\n.list-unstyled {\n    list-style: none;\n    padding: 0;\n  }\n</code>\n</pre>\n<p>Another one you may recognize from Bootstrap. Sometimes you may need to remove the bullets in an unordered list or (less common) the numbers in an ordered list.</p>\n<h2 id=\"multicolumn-list\">Multicolumn List <a class=\"direct-link\" href=\"#multicolumn-list\">#</a></h2>\n<pre>\n<code>\n.list-multi-col{\n\tcolumn-width: 12em;\n\tcolumn-gap: 2em;\n}\n</code>\n</pre>\n<p>Helpful for displaying long lists of short words or terms. Think of a donor wall at a museum for a real-life example. I’ve used this pattern on <a href=\"https://advocacy.tennessee.edu/ut-impact/\">advocacy.tennessee.edu</a> and <a href=\"https://data.tennessee.edu/impact-by-county/\">data.tennessee.edu</a>.</p>\n<p>In fact, I’ve found these so useful, all six of these utilities (plus a few more) have made their way into the <a href=\"https://github.com/nsmsn/nicksimsondotcom/tree/master/src/sass\">nicksimson.com codebase</a>.</p>\n",
      "date_published": "2021-08-07T00:00:00Z"
    },{
      "id": "https://nicksimson.com/posts/2021-gridless-modern-css/",
      "url": "https://nicksimson.com/posts/2021-gridless-modern-css/",
      "title": "Gridlessness and modern CSS",
      "content_html": "<p>I just finished reading <a href=\"https://gridless.design/\">gridless.design</a>, Donnie D’Amato’s thesis (in the form of a website) for doing away with the <i>n</i>-column grid or the <i>n</i>-pixel grid in the web design process. <a href=\"https://gridless.design/\">Go read it</a>, if you haven’t already.</p>\n<p>I’m convinced by his argument, being someone who has designed and implemented designs from both sides of the fence. I’ve reached for frameworks like the <a href=\"https://960.gs/\">960 grid system</a> or <a href=\"https://getbootstrap.com/docs/5.0/layout/grid/\">Bootstrap's 12-column grid</a> in the past. I’m not going to come down as hard on Donnie on these kinds of tools–I still think they have their place. You can build a serviceable website with a ready to go UI quickly and cheaply. This very website uses the flexbox-based grid from Chris Ferdinandi’s <a href=\"https://cferdinandi.github.io/kraken/components.html\">Kraken project</a> in places, because sometimes frankly, you need to split up a <code>.container</code> class into halves, or thirds, or fourths.</p>\n<p>The Bootstrap 12-column grid, like all frameworks, was a product of a specific time and place. The best practical argument against reaching for these kinds of things today is that we just have better, more powerful tools for layout that can accomplish much more (in fewer lines of code).</p>\n<p>One of my new favorite websites (and newsletters) to learn from is <a href=\"https://moderncss.dev/\">ModernCSS.dev</a> by Stephanie Eckles. Newer CSS features and properties are making me re-think the number of <code>@media</code> queries and breakpoints I am writing, even in responsive designs. The best advice on breakpoints I’ve found is to write them when your design is breaking. Thanks to relative units, tools like <code>clamp</code>, you can design layouts with fluid typography that don’t break often, if at all.</p>\n<p>Stephanie’s <a href=\"https://thinkdobecreate.com/links/\">many other projects</a> are worth checking out; I’m particularly a fan of <a href=\"https://11ty.rocks/\">11ty Rocks!</a> as well as <a href=\"https://smolcss.dev/\">SmolCSS</a>.</p>\n<p>Another great resource for learning modern CSS was written by Andy Bell, commissioned by Google, at the enviable URL <a href=\"https://web.dev/learn/css/\">web.dev/learn/css/</a>. Each lesson in this course is self-contained, meaning you don’t need to move from the course from start to finish. And it is not just layout, either. There’s an entire lesson on CSS animation, and an entire lesson on gradients, for example.</p>\n<p>There’s never been a better time to learn CSS than now. It’s also a good time to time to re-learn CSS, especially if you are like me: tired of doing old hacks, and craving more elegant code.</p>\n",
      "date_published": "2021-07-21T00:00:00Z"
    },{
      "id": "https://nicksimson.com/posts/2021-javascript-with-morten/",
      "url": "https://nicksimson.com/posts/2021-javascript-with-morten/",
      "title": "Learn JavaScript with Morten Rand-Hendriksen",
      "content_html": "<p>I’ve learned a lot of technical skills from Morten Rand-Hendriksen’s courses on LinkedIn Learning (a.k.a. <a href=\"http://Lynda.com\">Lynda.com</a>). I met Morten in person in 2019 and had the chance to tell him this in person. Great guy.</p>\n<p>One of Morten’s latest offerings is the latest, redesigned <a href=\"https://www.linkedin.com/learning/javascript-essential-training/\">JavaScript Essential Training</a>, which was released in January 2021, with the <a href=\"https://github.com/LinkedInLearning/javascript-essential-training-2832077\">excercise files on GitHub</a>. At the time of publication, the videos are all available for free, no subscription required.</p>\n<p>I’m very intrigued by the design of course, which Morten explains in the <a href=\"https://www.linkedin.com/learning/javascript-essential-training/learning-javascript-backward\">lesson 9 video</a>:</p>\n<figure>\n <blockquote cite=\"https://www.linkedin.com/learning/javascript-essential-training/learning-javascript-backward\">\nWhen you learn JavaScript for the first time you typically start with the basics, variables then functions, then more advanced subjects. But, due to the popularity of JavaScript frameworks, like React and View, today the first introduction people have to JavaScript is often through advanced objects and methods. For this reason, I've chosen to turn our course on its head. We'll start with objects and methods, then look at other data types and the DOM, and finally cover methods, functions, and events at the very end.\n </blockquote>\n<figcaption>—Morten Rand-Hendriksen, on <cite><a href=\"https://www.linkedin.com/learning/javascript-essential-training/learning-javascript-backward\">Learning JavaScript Backward</a>.</cite></figcaption>\n</figure>\n<p>When friends and coworkers ask me about learning to design for the web, I always suggest learning HTML, CSS and JavaScript in that order. When you work on the web, you never stop learning these technologies because they are always evolving. For me, JavaScript was the most difficult to learn, and because of the kinds of sites I tend to build, one I reach for the least. In terms of mastery, I think I am proficient at HTML and CSS. JavaScript? I’m <em>competent</em>. I can read it, I can write it, but sadly I haven’t been paying attention to the newest features.</p>\n<p>I’m excited to dig in and re-learn the fundamentals through this course, and hopefully be on my way to mastery.</p>\n",
      "date_published": "2021-02-21T00:00:00Z"
    },{
      "id": "https://nicksimson.com/posts/2021-engine-building-garden/",
      "url": "https://nicksimson.com/posts/2021-engine-building-garden/",
      "title": "An engine, a building, a garden",
      "content_html": "<p>For a couple years, I have been maintaining a collection on <a href=\"http://Are.na\">Are.na</a> called <a href=\"https://www.are.na/nick-simson/the-art-of-the-personal-website\">The Art of the Personal Website</a>. There are larger and more popular lists and directories, but I mainly use this as a repository for personal sites that catch my eye as I come across them in the wild. Some are <a href=\"https://www.nicchan.me/projects/\">portfolios</a>, some are <a href=\"https://macwright.com/\">blogs</a>. Some are harder to classify. Some sites have a <a href=\"https://estrattonbailey.com/\">minimal layout and aesthetic</a>, some are much more <a href=\"https://nathan.tokyo/\">experimental</a>. All have something about them that feels handcrafted.</p>\n<p>As I've been clipping and saving these personal sites I've been thinking about my own neglected web presence. Since <a href=\"/2020-newww-year/\">I announced my open redesign</a> in December, I have been thinking of a bunch of different metaphors for what I am doing in the evenings and early mornings as I work on this site.</p>\n<h2 id=\"my-site-is-an-engine.\">My site is an engine. <a class=\"direct-link\" href=\"#my-site-is-an-engine.\">#</a></h2>\n<p>When I have a few spare hours to work on this, I feel like I'm escaping to garage to tinker with an engine. My site is a collection of files, but it is also a build process. I type <code>npm start</code> in the Terminal app, and everytime I save a file I can watch the window cascading through changes, rebuilding the site. I test my site in emulators, on bad Wi-Fi, or in Google's <a href=\"https://developers.google.com/web/tools/lighthouse\">Lighthouse</a>, trying to make sure the experience is optimal in all these situations. When I commit changes to my repository, I trigger another process, rebuilding the site on the hosting platform, making these changes available for all to see.</p>\n<h2 id=\"my-site-is-a-building.\">My site is a building. <a class=\"direct-link\" href=\"#my-site-is-a-building.\">#</a></h2>\n<p>It says it up there in the header navigation: &quot;Home&quot;. Unlike the home I physically occupy, this digital home is relatively easy and cheap to add on to. On the same commit as this new post, I added a <a href=\"/library\">library</a>. I have read those books, but don't own physical copies of all of these. But linking to <a href=\"https://worldcat.org/\">worldcat.org</a>, I can carry the record of the book around with me. Some day, I keep telling myself, I'll add a gallery in the front entrance where I can show off my best work. As I add on the site I'm writing new rules to the CSS file, adding another new coat of paint. Other times I feel like I'm sorting through boxes in the attic, revisiting old things I made, getting rid of things that are no longer meaningful.</p>\n<h2 id=\"my-site-is-a-garden.\">My site is a garden. <a class=\"direct-link\" href=\"#my-site-is-a-garden.\">#</a></h2>\n<p>The concept of a digital garden is new to me, but intriguing. The basic idea of a garden is the intentional pruning and weeding of content, and letting ideas grow organically. <a href=\"https://maggieappleton.com/\">Maggie Appleton</a> articulates the digital gardening ethos for the 2020s:</p>\n<figure>\n    <blockquote cite=\"https://maggieappleton.com/garden-history\">\n        <p>“Rather than presenting a set of polished articles, displayed in reverse chronological order, these sites act more like freeform, work-in-progress wikis. They're collections of evolving ideas that aren't strictly organised by their publication date. They're inherently exploratory...They're less rigid, less performative, and less perfect than the personal websites we're used to seeing. It harkens back to the early days of the web when people had fewer notions of how websites \"should be.\" It's an ethos that is both classically old and newly imagined.”</p>\n       </blockquote>\n    <figcaption>—Maggie Appleton, <cite><a href=\"https://maggieappleton.com/garden-history\">A Brief History & Ethos of the Digital Garden</a></cite></figcaption>\n</figure>\n<p>My <a href=\"/posts\">writing archive</a> does follow a traditional reverse-chronological blog format, but reading about digital gardens inspires me to explore ways I can thread together my original work and the ideas I stumble upon in more novel ways than <a href=\"/tags/\">tags</a> (yes,I have those, too) and one-directional links. Well-designed public gardens often have multiple entry points, and I wonder how I could create more exploration beyond the traditional home page or landing pages.</p>\n<p>I also like Ethan Marcotte's advice to <a href=\"https://ethanmarcotte.com/wrote/let-a-website-be-a-worry-stone/\">let a website be a worry stone</a>. When I started posting reading lists on this website, I had a re-realization that this was a personal site, and I was designing it for me. There are no analytics tracking your movement around the internet on this space, and that's intentional. I'm doing my best to make the text readable and enjoyable. My content hopefully slows you down, not funnels you into some kind of sales pitch. The slowest part of the design is the solitary person behind the screen, in his living room, typing words into a text editor, making minute adjustments to the stylesheet. Sometimes (<em>gasp</em>), the new post and the design change are on the same git commit!</p>\n<p>I still remember some great website advice from Cathy, one of the first people to hire me to design. I had a fledgling website in 2007, paltry web skills and a meager portfolio, so I had placed a big bold <strong>Under Construction</strong> notice on my front page. She said that all websites are constantly in a state of construction, and suggested I take that off.</p>\n<img src=\"/img/post-images/2021-open-redesign.png\" alt=\"Open redesign notice\" />\n<p>At some point, I will remove the open redesign notice in my <code>base.njk</code> template as I get more confident with the layout decisions, type scale, responsive images, components, and all the fiddly bits that make a website. But <em>hopefully</em> that will not be the end of the thinking, refining, working in public on this domain.</p>\n",
      "date_published": "2021-02-17T00:00:00Z"
    },{
      "id": "https://nicksimson.com/posts/2021-redesign-a11y-perf/",
      "url": "https://nicksimson.com/posts/2021-redesign-a11y-perf/",
      "title": "Accessibility and Performance",
      "content_html": "<p>I have read and agree with Robin Rendle's sentiment: <a href=\"https://css-tricks.com/accessibility-and-web-performance-are-not-features-theyre-the-baseline/\">accessibility and web performance are not features, they’re the baseline </a>.</p>\n<p>That said, I want to spend a little bit of time highlighting some of the front end code I'm excited about that keeps my website fast and usable.</p>\n<h2 id=\"skip-link\">Skip Link <a class=\"direct-link\" href=\"#skip-link\">#</a></h2>\n<p>If you inspect the markup of each page the very first link in the <code>body</code> of my website is a &quot;Skip to Content Link&quot;, an anchor tag that links to the <code>main</code> element with an ID of &quot;main-content&quot;. When you select the link the page will scroll down to the &quot;main-content&quot; ID applied to the <code>main</code> element, <em>skipping</em> all the navigation links on its way down.</p>\n<p>When CSS is loaded, the skip link is visually hidden by the following CSS:</p>\n<pre>\n<code>\n  .skip-link:not(:focus) {\n    border: 0;\n    clip: rect(0 0 0 0);\n    height: auto;\n    margin: 0;\n    overflow: hidden;\n    padding: 0;\n    position: absolute;\n    width: 1px;\n    white-space: nowrap;\n  }\n</code>\n</pre>\n<p>This visually hidden code snippet can also be found on <a href=\"https://piccalil.li/quick-tip/visually-hidden\">Andy Bell's website</a></p>\n<p>Tabbing through the <code>header</code> element with a keyboard reveals the Skip to Content link, styled as a large button (you can't miss it):</p>\n<img src=\"/img/post-images/2021-skip-link.png\" loading=\"lazy\" alt=\"Light blue Skip to content link visible on Nick Simson dot com\" width=\"603\">\n<p>The styled link also has a hover style applied:</p>\n<img src=\"/img/post-images/2021-skip-link-hover.png\" loading=\"lazy\" alt=\"Navy blue Skip to content link with hover styles applied\" width=\"603\">\n<p>The following CSS gives a smooth-scrolling animation to all in-page links (as long as <a href=\"https://caniuse.com/css-scroll-behavior\">the browser supports the <code>scroll-behavior</code> property</a>):</p>\n<pre>\n<code>\nhtml {\n  scroll-behavior: smooth;\n}\n</code>\n</pre>\n<p>If <code>scroll-behavior</code> is not supported, the link still works and will just jump to the section of the page. This will be the behavior if the visitor has disabled motion and animation in their browser preferences:</p>\n<pre>\n<code>\n/* Remove all animations and transitions for people that prefer not to see them */\n@media (prefers-reduced-motion: reduce) {\n  *,\n  *::before,\n  *::after {\n    animation-duration: 0.01ms !important;\n    animation-iteration-count: 1 !important;\n    transition-duration: 0.01ms !important;\n    scroll-behavior: auto !important;\n  }\n}\n</code>\n</pre>\n<p>Again, these snippets are courtesy of Andy Bell, via his <a href=\"https://piccalil.li/blog/a-modern-css-reset\">modern CSS reset</a>.</p>\n<h2 id=\"optional-web-fonts\">Optional Web Fonts <a class=\"direct-link\" href=\"#optional-web-fonts\">#</a></h2>\n<p>This one may prove controversial. I am implementing the following in all @font-face declarations since I am using <a href=\"/posts/2020-redesign-webfonts-html/\">three webfonts</a>:</p>\n<pre>\n<code>\n @font-face {\n    font-display: optional;\n  }\n</code>\n</pre>\n<p>If any of the fonts take longer than 100 milliseconds to render on the initial page load, the fallback font will display instead. The fonts will be visible on refresh, or the next page a visitor reaches. Since I picked typefaces that are close to the proportions of the system defaults, this isn't a huge deal to me, and I almost how many people will notice. But for the same reason, any Flash of Unstyled Text or layout shift in the design isn't a huge deal, and I could easily revert back to <code>font-display: swap</code>.</p>\n<p>Since I am serving the fonts with Google's CDN, I am also using <code>link rel=&quot;preconnect&quot;</code> before the font stylesheet to speed up the delivery of the fonts, which I'm treating as an enhancement to the page layout.</p>\n<p>Simon Hearne has a big, long write-up on strategies to <a href=\"https://simonhearne.com/2021/layout-shifts-webfonts/\">avoid layout shifts caused by web fonts</a>, if you're interested in more of this topic.</p>\n<h2 id=\"native-lazy-loading\">Native Lazy Loading <a class=\"direct-link\" href=\"#native-lazy-loading\">#</a></h2>\n<p>Since this starting landing in web browsers in summer 2019, I'm getting in the habit of writing <code>loading=&quot;lazy&quot;</code> as an attribute on my images in posts, and adding this to previous posts on this site. This is an instruction to the browser to wait to load the image until it is close to coming in frame of the viewpoert. Thankfully, I'm not using a lot of images on a single page, but this will be handy if/when I add a portfolio to this site.</p>\n<p><a href=\"https://web.dev/browser-level-image-lazy-loading/\">Web.dev</a> and <a href=\"https://developer.mozilla.org/en-US/docs/Web/Performance/Lazy_loading\">MDN Web Docs</a> both have information on how this feature works.</p>\n<h2 id=\"wrapping-up\">Wrapping Up <a class=\"direct-link\" href=\"#wrapping-up\">#</a></h2>\n<p>If I add more code that enhances accessibility or performance, I will either add to this post or include snippets in a future follow-up post. In the meantime, you can catch up on my other <a href=\"/tags/redesign/\">posts tagged 'Redesign'</a>.</p>\n",
      "date_published": "2021-02-07T00:00:00Z"
    },{
      "id": "https://nicksimson.com/posts/2021-design-justice-principles/",
      "url": "https://nicksimson.com/posts/2021-design-justice-principles/",
      "title": "Design Justice Principles",
      "content_html": "<p>After I set up my <a href=\"/now/\">now page</a> late in December, I found myself creating <a href=\"https://nownownow.com/p/Mu02\">yet another profile</a>, to get included in the <a href=\"https://nownownow.com/\">directory of now pages</a>. My new profile included space for a book recommendation and a quote. I wanted my quote to be original and pithy, and after a moment, it popped in my head:</p>\n<blockquote><strong>“Design won’t change the world, but ordinary people will.”</strong></blockquote>\n<p>I think about this idea a lot. I often think about <em>Professional Design’s</em> (title case emphasis mine) proximity to capital and power. Meaning that, design as a human activity can be practiced by anyone—has been practiced for centuries in every human civilization all over the world—but as a profession, is elevated as either a luxury or business expense to those with the most money and influence. There are exceptions to this rule, and some alternative models, but this is largely the norm in most contemporary, (Western especially) contexts. Professionals, like all workers, need to be paid for their work, after all.</p>\n<p>I was definitely thinking about this idea while revisiting the <a href=\"/posts/2021-cedric-johnson-policing-education-inequality/\">Cedric Johnson lecture and interview from ArtCenter</a> on my blog earlier this month, particularly his engagement with the question “what does it mean to design for good?” In particular, Johnson cites <a href=\"https://www.architecturaldigest.com/story/brad-pitt-make-it-right-foundation-new-orleans-katrina-lawsuit\">Brad Pitt’s Make it Right Foundation homes</a> built after Hurricane Katrina, in the Lower Ninth Ward. As a showcase, the 109 homes designed by star architects were impressive, but only a “drop in the bucket” in terms of the actual housing need. At the same time as these cutting-edge single family units were being celebrated with media attention, thousands of displaced residents were unable to return as former public housing sites were being demolished in New Orleans.</p>\n<p><a href=\"https://www.daviddylanthomas.com/\">David Dylan Thomas</a> does excellent work writing and speaking on cognitive bias, design ethics, and social justice. At the end of David’s book <a href=\"https://abookapart.com/products/design-for-cognitive-bias\"><i>Design for Cognitive Bias</i></a>, he includes the Design Justice Network and their <a href=\"https://designjustice.org/read-the-principles\">ten principles</a> in his resources section.</p>\n<figure>\n    <blockquote cite=\"https://designjustice.org/read-the-principles\">\n   <ol>\n   <li>We use design to <strong>sustain, heal, and empower</strong> our communities, as well as to seek liberation from exploitative and oppressive systems.\n<p> </p>\n   </li>\n   <li>We <strong>center the voices of those who are directly impacted</strong> by the outcomes of the design process.\n<p> </p>\n   </li>\n   <li>We <strong>prioritize design’s impact on the community</strong> over the intentions of the designer.\n<p> </p>\n   </li>\n   <li>We view <strong>change as emergent from an accountable, accessible, and collaborative process</strong>, rather than as a point at the end of a process.\n<p> </p>\n   </li>\n   <li>We see the role of the <strong>designer as a facilitator rather than an expert</strong>.\n<p> </p>\n   </li>\n   <li>We believe that <strong>everyone is an expert based on their own lived experience</strong>, and that we all have unique and brilliant contributions to bring to a design process.\n<p> </p>\n   </li>\n   <li>We <strong>share design knowledge and tools</strong> with our communities.\n   &nbsp;\n   </li>\n   <li>We work towards <strong>sustainable, community-led and -controlled</strong> outcomes.\n<p> </p>\n   </li>\n   <li>We work towards <strong>non-exploitative solutions</strong> that reconnect us to the earth and to each other.\n<p> </p>\n   </li>\n   <li>Before seeking new design solutions, <strong>we look for what is already working</strong> at the community level. We honor and uplift traditional, indigenous, and local knowledge and practices.</li>\n   </ol>\n       </blockquote>\n    <figcaption><cite><a href=\"https://designjustice.org/read-the-principles\">Design Justice Network Principles</a> (published under a Creative Commons Attribution-NoDerivatives License)</cite></figcaption>\n</figure>\n<p>I find these principles challenging! The design professions are often seen as idealist, but in my experience, most people want to do the right thing. We often find ourselves making compromises with our ideals, or feeling hopeless about being caught in systems that are impossible to transform overnight by ourselves.</p>\n<p>I think the answer for designers who want to remedy social problems and broken systems is to choose one of these principles and think about what it means and how it could change your role. Find the ordinary people who have been dedicated to solving the problem—the community organizers. Listen to what has worked and what hasn't. Read the local history. Study the successful movements that have changed the world in the past.</p>\n<p>Offer your skills, yes, but share your knowledge and tools. Make the design process transparent, collaborative and inclusive. And hopefully, what you’ll find is you are practicing Solidarity, not merely Design.</p>\n",
      "date_published": "2021-01-30T00:00:00Z"
    },{
      "id": "https://nicksimson.com/posts/2021-cedric-johnson-policing-education-inequality/",
      "url": "https://nicksimson.com/posts/2021-cedric-johnson-policing-education-inequality/",
      "title": "Cedric Johnson on Public Goods and Inequality",
      "content_html": "<p>My introduction to Cedric Johnson and his work was an  <a href=\"https://www.youtube.com/watch?v=907lFP0j1Dg\">interview with Johnson on the Michael Brooks Show</a> (R.I.P.) in June of 2020.</p>\n<p>Afterward, I found a video of a guest lecture Johnson gave at ArtCenter College of Design in Pasadena, Calif. on the topic of the policing crisis and what the scholar refers to as the “technological fix”. The video below was recorded in 2019:</p>\n<div class=\"video-container\">\n<iframe src=\"https://www.youtube-nocookie.com/embed/z9PwqmLnLRc\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n</div>\n<blockquote>\n“I want to argue that [these problems are] deeply connected to the type of society we have and we’re implicated in it...we benefit in some ways from that style of policing. Much of a lifestyle we enjoy &ndash; the class position that a lot of us enjoy &ndash; is based on this policing that’s happening in other places.”\n</blockquote>\n<p>Cedric Johnson is a professor of Black studies and political science at University of Illinois at Chicago. He's probed the topic of <a href=\"https://journals.sagepub.com/doi/abs/10.1177/0169796X1102700409?journalCode=jdsb\">“humanitarian” design before, in an incisive paper</a> inspired by his research studying his native Louisiana following Hurricane Katrina. In his talk at ArtCenter, Johnson engages with an audience of designers and architects, to discuss the underlying issues of inequality that has expanded the role of policing in our communities and envision what a better society without poverty and violence could look like.</p>\n<p>Johnson returned to ArtCenter at the end of 2020 to record a follow-up with the Change Lab podcast, in a <a href=\"http://www.artcenter.edu/connect/dot-magazine/articles/change-lab-podcast-39-cedric-johnson-on-thinking-historically-about-racial-justice.html\">wide-ranging interview</a> with Lorne Buchman, president of the college. The two discuss Johnson’s own education and background, his scholarship on policing, Louisiana after Katrina, and ways to make higher education more universal and accessibile.</p>\n<audio controls>\n  <source src=\"https://www.podtrac.com/pts/redirect.mp3/chtbl.com/track/1C3AGD/traffic.megaphone.fm/LIT4207515901.mp3\" type=\"audio/mpeg\" />\n  Visit the source on <a href=\"http://www.artcenter.edu/connect/dot-magazine/articles/change-lab-podcast-39-cedric-johnson-on-thinking-historically-about-racial-justice.html\">ArtCenter.edu</a>.\n</audio>\n<blockquote>\n“I think being aware of the context which you are working in and how particular design solutions might be adopted...Are they adopted in an ad hoc manner that excludes? Or will they be part of a solution carried out in way that has universal, or broad benefits?”\n</blockquote>\n<p>What I appreciate about Cedric Johnson’s analysis is the depths to which he interrogates history and social problems, and his rejection of anything reductive: simple answers, sloganeering, diversions from anything that gets to the root of a problem. In the months following the deaths of Breonna Taylor and George Floyd, and the protests and uprisings that followed throughout the country I have been engaging with Johnson’s work as well as the work of other scholars, writers, and organizers.</p>\n<p>Michelle Alexander’s <i>The New Jim Crow</i> was an important book that helped many understand policing and mass incarceration and the War on Drugs. I'd also recommend reading James Forman, Jr.’s <i>Locking Up Our Own</i> as a work that complicates Alexander’s narrative. If you are interested in the problem from a Black police officer’s perspective, I thought Matthew Horace’s <i>The Black and the Blue</i> was beautifully written. And when it comes out, I am eagerly anticipating Cedric Johnson’s next book.</p>\n",
      "date_published": "2021-01-17T00:00:00Z"
    },{
      "id": "https://nicksimson.com/posts/2020-in-books/",
      "url": "https://nicksimson.com/posts/2020-in-books/",
      "title": "Books finished in 2020",
      "content_html": "<p>There's a dearth of fiction on this 2020 list, and I'm going to try to correct that in 2021. I have a Pynchon novel on the nightstand as well as a Murakami audiobook on my phone.</p>\n<p>As always, this is not a list of endorsements—just an honest list of books I consumed. I will use a ⭐ star emoji to denote books I thoroughly enjoyed or would recommend. I'll also use emoji to denote whether I consumed each item on this list as a 📖 paper book, 📱ebook,  or listened as 🎧 audio.</p>\n<ol>\n<li>\n<p><i>Team Rodent: How Disney Devours the World </i><br>\nby Carl Hiaasen<br>\n🎧 <small>Finished on <time datetime=\"2020-01-13\">Jan. 13</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Listen, Liberal: Or, What Ever Happened to the Party of the People </i> ⭐<br>\nby Thomas Frank<br>\n🎧 <small>Finished on <time datetime=\"2020-01-21\">Jan. 21</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Frederick Douglass: Prophet of Freedom </i> ⭐<br>\nby David W. Blight<br>\n🎧 <small>Finished on <time datetime=\"2020-01-27\">Jan. 27</time></small><br>\n </p>\n</li>\n<li>\n<p><i>The Souls of Black Folk </i><br>\nby W.E.B. Du Bois<br>\n📖 <small>Finished on <time datetime=\"2020-02-08\">Feb. 8</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Before the Storm: Barry Goldwater and the Unmaking of the American Consensus </i> ⭐<br>\nby Rick Perlstein<br>\n🎧 <small>Finished on <time datetime=\"2020-02-11\">Feb. 11</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Mediated: How the Media Shapes Your World and the Way You Live in It </i><br>\nby Thomas de Zengotita<br>\n📖 <small>Finished on <time datetime=\"2020-02-23\">Feb. 23</time></small><br>\n </p>\n</li>\n<li>\n<p><i>The Enigma of Clarence Thomas </i><br>\nby Corey Robin<br>\n🎧 <small>Finished on <time datetime=\"2020-02-23\">Feb. 23</time></small><br>\n </p>\n</li>\n<li>\n<p><i>No Logo</i><br>\nby Naomi Klein<br>\n📖 <small>Finished on <time datetime=\"2020-03-17\">March 17</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Black Ops Advertising: Native Ads, Content Marketing, and the Covert World of the Digital Sell </i><br>\nby Mara Einstein<br>\n🎧 <small>Finished on <time datetime=\"2020-04-10\">April 10</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Mistaken Identity: Race and Class in the Age of Trump </i> ⭐<br>\nby Asad Haider<br>\n📱 <small>Finished on <time datetime=\"2020-04-12\">April 12</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Utopia for Realists: How We Can Build the Ideal World </i><br>\nby Rutger Bregman<br>\n🎧 <small>Finished on <time datetime=\"2020-05-02\">May 2</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Toward Freedom: The Case Against Race Reductionism </i> ⭐<br>\nby Touré F. Reed<br>\n📱 <small>Finished on <time datetime=\"2020-05-02\">May 4</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Sapiens: A Brief History of Humankind </i><br>\nby Yuval Noah Harari<br>\n🎧 <small>Finished on <time datetime=\"2020-05-16\">May 16</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Working: Researching, Interviewing, Writing </i> ⭐<br>\nby Robert A. Caro<br>\n🎧 <small>Finished on <time datetime=\"2020-05-24\">May 24</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Diversity, Inc.: The Failed Promise of a Billion-Dollar Business </i><br>\nby Pamela Newkirk<br>\n🎧 <small>Finished on <time datetime=\"2020-05-28\">May 28</time></small><br>\n </p>\n</li>\n<li>\n<p><i>How to Be an Antiracist </i><br>\nby Ibram X. Kendi<br>\n🎧 <small>Finished on <time datetime=\"2020-06-11\">June 11</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Racecraft: The Soul of Inequality in American Life</i> ⭐<br>\nby  Karen E. Fields and Barbara J. Fields</p>\n<p>📱 <small>Finished on <time datetime=\"2020-06-21\">June 21</time></small><br>\n </p>\n</li>\n<li>\n<p><i>The Impeachers: The Trial of Andrew Johnson and the Dream of a Just Nation </i><br>\nby Brenda Wineapple<br>\n📱 <small>Finished on <time datetime=\"2020-06-28\">June 28</time></small><br>\n </p>\n</li>\n<li>\n<p><i>The Bone and Sinew of the Land: America's Forgotten Black Pioneers and the Struggle for Equality </i> ⭐<br>\nby Anna-Lisa Cox<br>\n📖 <small>Finished on <time datetime=\"2020-07-13\">July 13</time></small><br>\n </p>\n</li>\n<li>\n<p><i>The Psychopath Test: A Journey Through the Madness Industry </i><br>\nby Jon Ronson<br>\n📱 <small>Finished on <time datetime=\"2020-07-18\">July 18</time></small><br>\n </p>\n</li>\n<li>\n<p><i>A Generation of Sociopaths: How the Baby Boomers Betrayed America </i><br>\nby Bruce Cannon Gibney<br>\n🎧 <small>Finished on <time datetime=\"2020-07-23\">July 23/time&gt;</small><br>\n </p>\n</li>\n<li>\n<p><i>Against the Web: A Cosmopolitan Answer to the New Right </i><br>\nby Michael Brooks<br>\n📱 <small>Finished on <time datetime=\"2020-07-23\">July 23</time></small><br>\n </p>\n</li>\n<li>\n<p><i>The Color of Money: Black Banks and the Racial Wealth Gap </i> ⭐<br>\nby Mehrsa Baradaran<br>\n🎧 <small>Finished on <time datetime=\"2020-09-02\">Sept. 2</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Had I Known</i><br>\nby Barbara Ehrenreich<br>\n🎧 <small>Finished on <time datetime=\"2020-09-11\">Sept. 11</time></small><br>\n </p>\n</li>\n<li>\n<p><i>So You've Been Publicly Shamed</i><br>\nby  Jon Ronson<br>\n📱 <small>Finished on <time datetime=\"2020-09-20\">Sept. 20</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Class Notes: Posing As Politics and Other Thoughts on the American Scene</i> ⭐<br>\nby Adolph L. Reed Jr.<br>\n📱 <small>Finished on <time datetime=\"2020-09-23\">Sept. 23</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Why Are All the Black Kids Sitting Together in the Cafeteria?</i><br>\nby Beverly Daniel Tatum<br>\n🎧 <small>Finished on <time datetime=\"2020-10-25\">Oct. 25</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Loaded: A Disarming History of the Second Amendment </i><br>\nby  Roxanne Dunbar-Ortiz<br>\n🎧 <small>Finished on <time datetime=\"2020-10-31\">Oct. 31</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Caste: The Origins of Our Discontents </i><br>\nby  Isabel Wilkerson<br>\n📱 <small>Finished on <time datetime=\"2020-11-10\">Nov. 10</time></small><br>\n </p>\n</li>\n<li>\n<p><i>How to Do Nothing: Resisting the Attention Economy </i><br>\nby Jenny Odell<br>\n📱 <small>Finished on <time datetime=\"2020-11-19\">Nov. 19</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Grandstanding: The Use and Abuse of Moral Talk </i><br>\nby Justin Tosia and Brandon Warmke<br>\n🎧 <small>Finished on <time datetime=\"2020-11-20\">Nov. 20</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Something That May Shock and Discredit You </i><br>\nby Daniel M. Lavery<br>\n🎧 <small>Finished on <time datetime=\"2020-11-26\">Nov. 26</time></small><br>\n </p>\n</li>\n<li>\n<p><i>This America: The Case for the Nation </i><br>\nby Jill Lepore<br>\n🎧 <small>Finished on <time datetime=\"2020-12-06\">Dec. 6</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Content Strategy for the Web </i> ⭐<br>\nby Kristina Halvorson<br>\n📱 <small>Finished on <time datetime=\"2020-12-06\">Dec. 6</time></small><br>\n </p>\n</li>\n<li>\n<p><i>The Socialist Manifesto: The Case for Radical Politics in an Era of Extreme Inequality </i><br>\nby Bhaskar Sunkara<br>\n🎧 <small>Finished on <time datetime=\"2020-12-22\">Dec. 22</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Cross-Cultural Design </i><br>\nby Senongo Akpem<br>\n📱 <small>Finished on <time datetime=\"2020-12-24\">Dec. 24</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Locking Up Our Own: Crime and Punishment in Black America </i> ⭐<br>\nby James Forman Jr.<br>\n📖 <small>Finished on <time datetime=\"2020-12-26\">Dec. 26</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Evil Geniuses: The Unmaking of America </i><br>\nby Kurt Andersen<br>\n🎧 <small>Finished on <time datetime=\"2020-12-26\">Dec. 26</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Accessibility for Everyone</i> ⭐<br>\nby Laura Kalbag<br>\n📱 <small>Finished on <time datetime=\"2020-12-31\">Dec. 31</time></small><br>\n </p>\n</li>\n</ol>\n",
      "date_published": "2020-12-31T00:00:00Z"
    },{
      "id": "https://nicksimson.com/posts/2020-redesign-scaffolding/",
      "url": "https://nicksimson.com/posts/2020-redesign-scaffolding/",
      "title": "Scaffolding",
      "content_html": "<p>A few things have changed visually since <a href=\"http://web.archive.org/web/20201221200650/http://nicksimson.com/\">the last snapshot</a>: Some of the base styles, the header, the footer, the <a href=\"https://nicksimson.com\">home page</a>. I want to write a little about some things happening behind the scenes.</p>\n<p>As I mentioned previously, I started out with the <a href=\"https://github.com/11ty/eleventy-base-blog\">eleventy-base-blog</a> starter project, mainly to get the github/netlify deployment set up quickly and painlessly. Since then, as I started modifying base styles, I quickly realized that I wanted to break up my CSS into smaller pieces, much in the way the site templates are seperated in the <code>_includes / layouts</code> directory.</p>\n<p>I explored some of the other <a href=\"https://www.11ty.dev/docs/starter/\">starter projects in Eleventy's documentation</a> to see how CSS is being used. In addition to every possible CSS flavor (Tailwind, Sass, PostCSS) you can imagine, I found a couple projects that keep a <code>src</code> directory with the templates and content seperate from the <code>.eleventy.js</code> and <code>.package.json</code> files and other configuration stuff.</p>\n<p><a href=\"https://thinkdobecreate.com/\">Stephanie Eckles</a> has an awesome  <a href=\"https://egghead.io/playlists/build-an-eleventy-11ty-site-from-scratch-bfd3\">tutorial on egghead.io</a> where she shows how to set up a simple Eleventy project with Node Sass and a <code>src</code> directory that outputs to a <code>public</code> folder with the static site. This fit the bill of what I'm after.</p>\n<p>I know not every developer likes Node Sass, but I am still trying to use fewer dependencies, and I still like the idea of running everything through <code>npm start</code> rather than setting up a complicated build process. I tend to mainly use variables and imports and very few mixins so I don't need all the latest and greatest in &quot;Dart&quot; Sass/canonical Sass.</p>\n<p>I forked the eleventy-base-blog project and spun up <a href=\"https://github.com/nsmsn/eleventy-base-blog-sass\">my own version on GitHub</a> a few days ago. My version has a <code>src</code> directory and uses Node Sass. The site that outputs on the <code>public</code> folder looks identical to the official 11ty one.</p>\n<p>Here's how the <code>sass</code> folder is structured to output my <a href=\"https://www.nicksimson.com/css/style.css\">style.css</a> file:</p>\n<pre>\n\nsass\n├── _base.scss\n├── _code.scss\n├── _config.scss\n├── _reset.scss\n├── _type.scss\n├── blocks\n├── style.scss\n└── utils\n\n</pre>\n<p>The files in the root of this directory are named with an underscore (_) and are mainly for global styles and code highlighting. <code>_config.scss</code> is a bunch of CSS variables (sizes, colors and font stacks) that will be used in the other files. In the folders named &quot;blocks&quot; and &quot;utils&quot; are where most of the CSS rules with classes are written. The big difference is that a &quot;block&quot; covers make up structures like page layouts and components. &quot;Utils&quot; are reusable utility classes that modify the appearance of an element or block.</p>\n<p>The CSS is written so that the broadest, most generic rules are at the top of the stylesheet, followed by reusable classes that describe layouts and components, followed by more specific styles and overrides.  My <code>style.scss</code> file is only <code>@import</code> rules and is stuctured as follows:</p>\n<pre>\n@import \"config\";\n@import \"reset\";\n@import \"base\";\n@import \"type\";\n@import \"code\";\n\n@import \"blocks/layout\";\n@import \"blocks/header\";\n@import \"blocks/nav\";\n@import \"blocks/postlist\";\n@import \"blocks/tags\";\n@import \"blocks/markdown\";\n@import \"blocks/warning\";\n@import \"blocks/panel\";\n@import \"blocks/pagination\";\n\n@import \"utils/flexo\";\n@import \"utils/float\";\n@import \"utils/flow\";\n@import \"utils/lists\";\n@import \"utils/sr-only\";\n@import \"utils/color\";\n</pre>\n<p>As I develop and add more to the site, I expect these files may change a little, but the structure is designed for living projects, and designed to scale. The CSS I'm writing these days follows concepts similar to Andy Bell's <a href=\"https://piccalil.li/cube-css/\">CUBE CSS</a> and Harry Roberts' <a href=\"https://www.xfive.co/blog/itcss-scalable-maintainable-css-architecture/\">ITCSS</a> projects. I invite you to check both approaches out if you are either starting out in web development or looking for a way to write object-oriented styles for more maintainable stylesheets.</p>\n<p><em>This was the third post in the <a href=\"/tags/redesign/\">'redesign' series</a>.</em></p>\n",
      "date_published": "2020-12-30T00:00:00Z"
    },{
      "id": "https://nicksimson.com/posts/2020-redesign-webfonts-html/",
      "url": "https://nicksimson.com/posts/2020-redesign-webfonts-html/",
      "title": "Web fonts and base HTML",
      "content_html": "<figure>\n    <img src=\"/img/post-images/2020-12-webfonts.png\" class=\"photo-border\"\n         alt=\"NickSimson dot com homepage\" />\n    <figcaption>The current homepage with web fonts enabled</figcaption>\n</figure>\n<p>If you are reading this post, it is likely you are viewing this with the webfonts. In my last <a href=\"/posts/newww-year/\">redesign post</a>, I loosely mapped out some goals, including beauty, performance, accessibility, and celebrating open source.</p>\n<p>In that spirit, I picked out three new typefaces to use on my site.</p>\n<h2 id=\"why-three%3F\">Why Three? <a class=\"direct-link\" href=\"#why-three%3F\">#</a></h2>\n<p>While there are several ways to classify type, there are three major fallbacks you can tell a browser to use at the end of a CSS font stack: <code>serif</code>, <code>sans-serif</code>, and <code>monospace</code>. What these fallbacks actually are largely depends on your browser or operating system.</p>\n<figure>\n    <img src=\"/img/post-images/2020-12-fallbackfonts.png\" class=\"photo-border\"\n         alt=\"NickSimson dot com homepage\" />\n    <figcaption>The current homepage with web fonts disabled and the fallback type displayed</figcaption>\n</figure>\n<p>Using CSS custom properties, I can set simple variables at the <code>:root</code> for each font type. This will make it easy to remember a variable rather than a whole font stack</p>\n<pre><code>\n:root {\n    --sans: 'Epilogue', 'Segoe UI', Roboto, \"Helvetica Neue\", Helvetica, Arial, sans-serif;\n    --serif: 'Literata', Georgia, serif;\n    --mono:  'IBM Plex Mono', Consolas, Menlo, Monaco, \"Andale Mono\", \"Lucida Console\", \"Courier New\", Courier, monospace;\n  }\n</code></pre>\n<p>I build websites with <a href=\"https://developer.mozilla.org/en-US/docs/Glossary/Progressive_Enhancement\">progressive enhancement</a> in mind, so I use a pretty robust fontstack in my CSS, declaring common fallbacks available to different devices. For these three categories, I selected fonts that have proportions roughly equivalent to my default fallbacks. Right now I am not using a dramatic font loading strategy (more about that later), relying on a 'flash of unstyled text' or FOUT, if the network can't load my custom fonts.</p>\n<h2 id=\"character-traits\">Character Traits <a class=\"direct-link\" href=\"#character-traits\">#</a></h2>\n<p>I did not pick three typefaces at random. My last design used a bookish serif called <a href=\"https://fontsinuse.com/typefaces/28/chaparral\">Chaparral Pro</a>, designed by <a href=\"http://www.alphabettes.org/review-carol-twombly-her-brief-but-brilliant-career-in-type-design/\">Carol Twombly</a>. This was one of the first webfonts available a decade ago when Typekit (now Adobe Fonts) launched and true web typography first became a thing. I still adore Chaparral, but it doesn't quite meet my criteria for my new site. The webfont version is a bit heavier than most of the other serifs on Adobe Fonts, the design itself is a bit of a hybrid between a humanist serif and a slab serif, with proportions that don't map close (or close enough for my discerning eye) to common fallbacks like Georgia and Times New Roman.</p>\n<p>I chose <a href=\"https://www.type-together.com/literata-3\">Literata</a> instead, designed by Type Together (Veronika Burian and José Scaglione) and originally commissioned for Google Books in 2014. Since this design was made for reading devices, it certainly fits the &quot;bookish&quot; look I'm going for, and to the untrained eye, looks similar in proportion and style to Matthew Carter's <a href=\"https://fontsinuse.com/typefaces/70/georgia\">Georgia</a>, another type designed for the screen first that has wide support on operating systems and browsers. Literata's killer feature for me, though is the <i>upright italics</i>, which are unusual to see in contemporary designs, and first caught my eye in 2014 when I saw it online.</p>\n<p>It also helps that the redesigned and open-sourced Literata is available as a <a href=\"https://web.dev/variable-fonts/\">variable font</a>, which means I can use one file to achieve a wide variety of weights and display styles. I want to set my block quotes with a little more <em>oomph</em>, without making my visitors download an extra resource.</p>\n<p>For the sans-serif design, I wanted something that would work well for headlines, and be a distinct contrast from Literata. I've always been drawn to chunky nineteenth century grotesques, but I didn't want a revival typeface so much. I thought it would be a good idea to pick another variable font for versatility—an interface type for the header, navigation, and footer as well as headlines. I could a chunkier weight as a drop-cap on fancier, long posts down the road, or a lighter weight at smaller sizes for various <a href=\"https://www.uxbooth.com/articles/getting-ux-writing-right-with-microcopy/\">microcopy</a> instances.</p>\n<p>Looking at the other open source variable fonts from Google, I discovered <a href=\"https://www.etceteratype.co/epilogue\">Epilogue</a> by Tyler Finck, another design introduced to the font service in 2020. I like the uppercase letters and how they almost appear condensed, but not quite as condensed as <a href=\"https://www.productiontype.com/family/stratos\">Stratos</a>. I dig the slight curved edge of the lowercase <b>t</b> as well as the open loop tail on the two-story <b>g</b>, as well as the numbers. The name <em>Epilogue</em> fits in so nicely with <em>Literata</em>, continuing with that bookish theme. It doesn't hurt that Finck's Etcetera Type Company is based in Upstate New York, the region I grew up in.</p>\n<p>Being a designer who codes, I also needed a monospace—not just for code but stylistically for things like timestamps on my posts and even the <code>figcaption</code> element. Again, continuing with the theme, I wanted a monospace in that sweet spot between a terminal font and a typewriter font. The <a href=\"https://www.ibm.com/plex/\">Plex family from IBM</a> just so happens to be open source, and the old IBM Selectric typewriter happens to be in <a href=\"https://www.ibm.com/plex/plexness/#mono-for-coding\">Plex Mono's DNA</a>. Some of those rounded edges, distinct monospaced italics, and the two-story <b>g</b> all seem to compliment Epilogue and Literata. At the time of this writing, Plex Mono is not a variable font, so I will limit myself to a couple styles and a couple weights.</p>\n<p>I'm happy with the harmony of these three distinct voices. Its a little idiosyncratic, but not too weird, which suits me. Because this is my first time using variable fonts, I'm going to use Google's CDN and fonts API to serve my type for now. Down the road I may want to self-host for added performance and possibly revisit my font loading strategy. But I have other fish to fry.</p>\n<h2 id=\"back-to-base-ics\">Back to Base-ics <a class=\"direct-link\" href=\"#back-to-base-ics\">#</a></h2>\n<p>Now I have a lovely font stack I'm quite happy with. How do I put it all together? I want to revisit my base styles. I have a very simple style.css file inspired by <a href=\"https://piccalil.li/blog/a-modern-css-reset/\">Andy Bell's helpful post on resets</a>, now enhanced with a more idiosyncratic typographic palette. I want to see quickly how all my basic HTML elements (with no classes applied) look. I need a <a href=\"https://poormansstyleguide.com/\">poor man's style guide</a>.</p>\n<p>I created a new page at <a href=\"/html/\">nicksimson.com/html</a> where you can see each markup element:</p>\n<p> </p>\n<p><img src=\"/img/post-images/2020-12-headings.png\"  class=\"photo-border\"\n         alt=\"H1 through H6 styles\" /><br>\nAt a cursory glance, my headings need a little work.</p>\n<p><img src=\"/img/post-images/2020-12-blockquote-figcaption.png\" class=\"photo-border\"\n         alt=\"blockquote and figcaption styles\" /><br>\nNot sure about the blockquote yet, but I like the figcaption now.</p>\n<p><img src=\"/img/post-images/2020-12-dl-tables.png\" class=\"photo-border\"\n         alt=\"definition list and table styles\" /><br>\nThis area needs some work.</p>\n<p>It might seem controversial to stop here and make a commit, but I want to step back and think about the CSS structure I'll need before I write any more. I'd like to break up my CSS into smaller files, and think about the elements I'm using now and what I will need in the future.</p>\n<p>Plus, I have that disclaimer about stuff looking wonky on the top of each page. That should buy me some time. I'll come back later when I've cleaned up this mess. In the meantime, you can view the other tagged posts in the <a href=\"/tags/redesign/\">'Redesign' series</a>.</p>\n",
      "date_published": "2020-12-19T00:00:00Z"
    },{
      "id": "https://nicksimson.com/posts/2020-learn-html-with-jen-simmons/",
      "url": "https://nicksimson.com/posts/2020-learn-html-with-jen-simmons/",
      "title": "Learn HTML with Jen Simmons",
      "content_html": "<div class=\"video-container\">\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/zZCSTAR-4w0\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n</div>\n<p>I’ve learned a ton from <a href=\"https://jensimmons.com/\">Jen Simmons</a> over the past several years.</p>\n<p>I just finished watching her latest offering, the redesigned <a href=\"https://www.linkedin.com/learning/html-essential-training-4\">HTML Essential Training</a> course, for LinkedInLearning. Simmons' mastery of the fundamentals of the web (HTML, CSS, JavaScript) is impeccable.</p>\n<figure>\n    <blockquote cite=\"https://shoptalkshow.com/415/\">\n        <p>It's really for anybody. It's for people who are on some kind of Web content team who were English majors in school and they're all about writing and marketing, maybe. They don't know anything about technology but they have to click over in their WordPress blog to the HTML section. It freaks them out. They don't know what any of that stuff is...It's not a beginner course. I think LinkedIn Learning does have an even more simple beginner course, and this course is, like, \"Oh, you might be a Ph.D. holding computer science major who is an expert in Java and something-something, and now you switched to the Web team. This HTML thing is weird, annoying, and you're not really sure which element you're supposed to be using for what. You don't really understand it.\" The course is really for both audiences at the same time.</p>\n       </blockquote>\n    <figcaption>—Jen Simmons, on the <cite><a href=\"https://shoptalkshow.com/415/\">Shop Talk Show podcast</a></cite></figcaption>\n</figure>\n<p>The course is <a href=\"https://www.linkedin.com/learning/html-essential-training-4\">being offered for free right now</a>, and is approachable whether you are just getting started putting things on the web or have been at this stuff for 25 years.</p>\n<p>HTML is how we communicate meaning online, and anyone can learn this skill!</p>\n",
      "date_published": "2020-12-18T00:00:00Z"
    },{
      "id": "https://nicksimson.com/posts/2020-newww-year/",
      "url": "https://nicksimson.com/posts/2020-newww-year/",
      "title": "Ready for a Newww Year",
      "content_html": "<p>In late 2020, the coronavirus pandemic is raging in the U.S. and colder weather makes outdoor gathering less appealing. To stave off some of the cabin fever this winter, I'm ready to revisit my own website, which I have sadly left dormant until this week. My dad often talks about his grandfather, a carpenter, who was often so busy working on other people's homes, the upstairs of his own house was left unfinished for many years. The metaphor seems appropriate today.</p>\n<p>Rather than simply applying a fresh coat of paint, I'm taking this down to the studs and thinking about what I want it to be in 2021 and beyond. I find the <a href=\"https://indieweb.org/\">IndieWeb</a> ethos more and more appealing: Publishing on my own platform rather than a commercial social network and tinkering around with technologies to scratch an itch.</p>\n<p>In the spirit of <a href=\"https://twitter.com/jensimmons/status/943323088405581824\">New Years' resolutions</a>, I put together an unordered list detailing what I want to accomplish with this rebuild:</p>\n<ul>\n<li>Build a beautiful website that represents me and my values.</li>\n<li>Make something easy to deploy and easier to maintain.</li>\n<li>Build something fast and accessible.</li>\n<li>Celebrate the commons, fair use and open source.</li>\n<li>Learn my medium (HTML, CSS, JS), broad and deep.</li>\n<li>Share what I know.</li>\n</ul>\n<p>I do not know yet when I will take down the &quot;open redesign&quot; banner at the top of this, as the site will continue to evolve, but I expect I will lower that flag sometime in 2021.</p>\n<h2 id=\"this-goes-to-eleventy\">This goes to Eleventy <a class=\"direct-link\" href=\"#this-goes-to-eleventy\">#</a></h2>\n<p>After following the bandwagon and hosting with <a href=\"https://jekyllrb.com/\">Jekyll</a> and <a href=\"https://pages.github.com/\">Github Pages</a> for years, I am following the bandwagon yet again and migrating to <a href=\"https://11ty.dev/\">Eleventy</a> and <a href=\"https://netlify.com/\">Netlify</a>. The site structure, templating languages and deployment concept is quite similar, but I really like the performance speed of developing locally with Eleventy committing my changes with git and the git-based deployment to Netlify.</p>\n<p>Before committing to Eleventy, I checked out the project's documentation, plus several articles and podcasts. For a brief overview, I'd recommend the <a href=\"https://podcast.smashingmagazine.com/episodes/what-is-eleventy-with-david-darnes\">Smashing Podcast on Eleventy with Drew McLellan and David Darnes</a> discussing the project.</p>\n<p>I also purchased a copy of Andy Bell's <a href=\"https://piccalil.li/course/learn-eleventy-from-scratch/\">Learn Eleventy from Scratch</a> course and went through all the lessons in a weekend. Andy's course was just the right pace for me: I prefer following step by step instructions and reading the code more than trying to follow along with a video. While I like the build process and asset pipeline you create in the course, I will probably use fewer dependencies in my project. But I just love the idea of writing <code>npm start</code> to get going on active development.</p>\n<p>To get my GitHub and Netlify working together right away I used the deploy to netlify feature on the official <a href=\"https://github.com/11ty/eleventy-base-blog\">eleventy-base-blog project</a>. There are a lot of starter projects listed in the Eleventy documentation, but this one looks like it has the fewest dependencies. 'Deploy to Netlify' is like WordPress' five-minute install, but faster. The site you are looking at is pretty much that with some different CSS rules applied. The hardest thing to figure out updating DNS on my domain name, but I got it after reading <a href=\"https://dev.to/easybuoy/setting-up-domain-with-namecheap-netlify-1a4d\">this quick tutorial</a>.</p>\n<h2 id=\"this-old-website\">This Old Website <a class=\"direct-link\" href=\"#this-old-website\">#</a></h2>\n<p>If you miss the old site, I made sure to archive the <a href=\"http://web.archive.org/web/20200928234553/https://nicksimson.com/\">old home page</a> and <a href=\"http://web.archive.org/web/20201021235738/https://nicksimson.com/blog/\">blog index</a> on the Internet Archive. All the <a href=\"https://github.com/nsmsn/personal-site-v1\">old code is still archived on GitHub</a>. I migrated my favorite and more relevant posts to a <a href=\"/posts/\">new archive</a>. In the sprit of owning my content, I also exported my annual reading lists from Goodreads to a post series—check out the <a href=\"/tags/books/\">'Books' tag</a>.</p>\n<p>I'll document changes in this blog with screenshots and a link to an Internet Archive capture. This website also has a <a href=\"https://github.com/nsmsn/nicksimsondotcom\">GitHub repository</a> where you can see everything that has changed.</p>\n<p>I will tag all these posts <a href=\"/tags/redesign/\">'Redesign'</a> if you want to follow along. Thanks for coming with me on this journey.</p>\n",
      "date_published": "2020-12-16T00:00:00Z"
    },{
      "id": "https://nicksimson.com/posts/2020-mmxx/",
      "url": "https://nicksimson.com/posts/2020-mmxx/",
      "title": "MMXX",
      "content_html": "<p>One of the last things we did before the lockdown was see the <a href=\"https://en.wikipedia.org/wiki/Beauford_Delaney\">Beauford Delaney</a> exhibit at the Knoxville Museum of Art.</p>\n<p><a href=\"https://knoxart.org/exhibitions/beauford-delaney-and-james-baldwin-through-the-unusual-door/\"><i>Through the Unusual Door</i></a> opened at KMA in Feburary and focused on the Knoxville-born artist's life, and friendship with the writer James Baldwin. The exhibit coincided with a <a href=\"https://baldwindelaney.org/\">Baldwin/Delaney symposium held at the University of Tennessee</a>, one of the last big in-person events at UT before thousands of students moved out after spring break and the university joined the rest of the country in a massive emergency shift to online-only instruction and events.</p>\n<p>We went to the museum a few days after Tennessee reported its first confirmed case of the novel coronavirus, in Williamson County. Days earlier we voted in the Super Tuesday primary, which coincided with a deadly tornado hitting the Nashville area. At work, I had helped stand up a little section of the website with some information on the coronavirus, linking to the CDC and some general safety information. At this time (early March), the CDC was reporting that face coverings were not necessary for ordinary people becuase of a shortage in personal protective equipment (PPE), one of several terms and acronyms that would become part of our household vocabulary.</p>\n<p>Neither Eleanor nor I would return to work in-person for months. What a difference a few days can make.</p>\n<p>Everyone handles emergencies differently. I think my experience of the first six weeks of the global COVID-19 pandemic was better than the following nine months. We were not in a &quot;hot spot&quot; for several weeks, but Knox County shut down much like the rest of the country. We started refreshing the now-ubiquitous daily case count dashboards and made a bunch of homemade face coverings from old shirts and fabric scraps. I built a table and set up a home office in our living room. I didn't start baking daily (although I did execute a good gluten-free pizza crust) or attempt a novel. My plague year project was to develop a regular exercise regiment (I chose jogging and <a href=\"http://www.c25k.com/\">Couch to 5K</a>), and to avoid getting the virus or spreading it.</p>\n<p>Homemade yard signs, window painting, and sidewalk chalk interventions sprang up in our neighborhood to thank healthcare workers. Eventually these were supplemanted or replaced with more yard signs and other sporadic interventions declaring solidarity with the Black Lives Matter movement. Then more general election yard signs and a handful of Trump flags appeared during my morning jogs or dog walks later in the summer. I proved that I could work at home for six months and still get things done, for the most part. <a href=\"https://oak.is/thinking/working-remotely-covid-19-principles/\">Expectations of what is &quot;productive&quot;</a> may have shifted during the global pandemic.</p>\n<figure>\n<img src=\"/img/post-images/2020-holzer-survival.jpg\" loading=\"lazy\" width=\"800\" height=\"573\">\n<figcaption>Jenny Holzer\n<p>American, b. 1950</p>\n<p>Survival Series: In a Dream You Saw a Way…, 1997</figcaption></p>\n</figure>\n<p>I've struggled and managed depression through most of my adulthood, and 2020 will definitely get chalked up as one of my lousier years. I know I'm not alone in this. Who hasn't experienced loneliness, disappointment and several dark nights of the soul this year? As I write this in mid-December, the whole state of Tennessee is a &quot;hot spot&quot; and the U.S. has lost the equivalent of the population of St. Louis, Missouri to COVID-19 deaths. The same number of people who perished in the September 11 terror attacks is dying daily around the country.</p>\n<p>The Beauford Delaney exhibit stayed up through October, and the University of Tennessee is showing a <a href=\"https://downtown.utk.edu/\">smaller Delaney show in its gallery in downtown Knoxville</a>. The summer and fall was good for hikes in the woods and small outdoor gatherings in our back yard. I returned to in-person work (masked and at a distance 2 days a week) for a brief while in late September, but since Thanksgiving our team is fully remote again, at least through the end of the holiday season.</p>\n<p>This time last year, we were in upstate New York for a huge wedding gathering. We spent Christmas day with my grandmother, one of the strongest women I know, but someone who is a member of a vulnerable population today. If this were a &quot;normal&quot; year we'd be getting ready to make a trip to Albuquerque or Phoenix to spend the holidays with our families. But this is the year of postponed visits. We are writing longer Christmas cards and making video chat plans instead.</p>\n<p><a href=\"https://www.nytimes.com/interactive/2020/12/03/opinion/covid-19-vaccine-timeline.html\"><i>The New York Times</i> informs me</a> I'll be one of the last people in my state and country to recieve the vaccine. I will get the vaccine as soon as my number is called. I expect I will be indoors and physically distant for much of the winter. Our county is breaking our previous records in new daily cases. I want to do a little more with my website here at the end of the year and into 2021. That and finish painting our hallway. Offline, I'll do what I can to organize and participate in mutual aid. To whom much is given, much is required.</p>\n<p>Thankfully I have not gotten sick or knowingly exposed to the virus this year. This is certainly due to personal privilege and my ability to work from home as much as my vigilance to the public health guidelines. Its getting colder and darker and I'm doing my best to jog regularly each week. I deleted Facebook back in 2018 and have <a href=\"https://twitter.com/nsmsn/status/1167017184419307520\">stayed off Twitter for more than a year now</a>. My preferred way of staying connected with friends and family is through texting, email, or a phone call. Nine months ago I was choosing &quot;stay resilient&quot; over telling people to &quot;stay sane&quot;. Now that word, 'resilient' feels like it is ringing hollow too.  If we know each other and I have not reached out to you this year, I am sorry. Hopefully you have my number or know how to reach me. I'd like to hear how you experienced this plague year. None of us are alone.</p>\n",
      "date_published": "2020-12-15T00:00:00Z"
    },{
      "id": "https://nicksimson.com/posts/2019-in-books/",
      "url": "https://nicksimson.com/posts/2019-in-books/",
      "title": "Books finished in 2019",
      "content_html": "<p>In 2019 I consumed a lot of books that I would consider &quot;impulse adds&quot; on Goodreads. A bunch were from authors I heard on radio or podcasts. I know I attempted a novel, a collection of short stories and maybe other works of fiction this year, but clearly they did not stick.</p>\n<p>As always, this is not a list of endorsements—just an honest list of books I consumed. I will use a ⭐ star emoji to denote books I thoroughly enjoyed or would recommend. I'll also use emoji to denote whether I consumed each item on this list as a 📖 paper book, 📱ebook,  or listened as 🎧 audio.</p>\n<ol>\n<li>\n<p><i>Kill All Normies: Online Culture Wars from 4chan and Tumblr to Trump and the Alt-Right </i><br>\nby Andrea Nagle<br>\n📱<small>Finished on <time datetime=\"2019-01-11\">Jan. 11</time></small><br>\n </p>\n</li>\n<li>\n<p><i>The Confidence Game: Why We Fall for It...Every Time </i><br>\nby Maria Konnikova<br>\n🎧 <small>Finished on <time datetime=\"2019-01-12\">Jan. 12</time></small><br>\n </p>\n</li>\n<li>\n<p><i>The State of Jones</i> ⭐<br>\nby Sally Jenkins and John Stauffer<br>\n🎧 <small>Finished on <time datetime=\"2019-01-28\">Jan. 28</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Janesville: An American Story</i><br>\nby Amy Goldstein<br>\n🎧 <small>Finished on <time datetime=\"2019-02-03\">Feb. 3</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Bullshit Jobs: A Theory </i><br>\nby David Graeber<br>\n🎧 <small>Finished on <time datetime=\"2019-02-09\">Feb. 9</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Bad Blood: Secrets and Lies in a Silicon Valley Startup </i> ⭐<br>\nby John Carreyrou<br>\n🎧 <small>Finished on <time datetime=\"2019-04-20\">April 20</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Ramp Hollow: The Ordeal of Appalachia </i> ⭐<br>\nby Steven Stoll<br>\n📖 <small>Finished on <time datetime=\"2019-05-04\">May 4</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Bunk: The True Story of Hoaxes, Hucksters, Humbug, Plagiarists, Forgeries, and Phonies </i><br>\nby Kevin Young<br>\n🎧 <small>Finished on <time datetime=\"2019-05-23\">May 23</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Give People Money: How a Universal Basic Income Would End Poverty, Revolutionize Work, and Remake the World</i><br>\nby Annie Lowrey<br>\n🎧 <small>Finished on <time datetime=\"2019-05-27\">May 27</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Zucked: Waking Up to the Facebook Catastrophe </i><br>\nby Roger McNamee<br>\n🎧 <small>Finished on <time datetime=\"2019-06-02\">June 2</time></small><br>\n </p>\n</li>\n<li>\n<p><i>The Black and the Blue: A Cop Reveals the Crimes and Racism in America's Law Enforcement and the Search for Change </i> ⭐<br>\nby Matthew Horace<br>\n🎧 <small>Finished on <time datetime=\"2019-06-16\">June 16</time></small><br>\n </p>\n</li>\n<li>\n<p><i>The Skeptics' Guide to the Universe: How to Know What's Really Real in a World Increasingly Full of Fake </i><br>\nby Steven Novella<br>\n🎧 <small>Finished on <time datetime=\"2019-07-04\">July 4</time></small><br>\n </p>\n</li>\n<li>\n<p><i>How Fascism Works: The Politics of Us and Them </i><br>\nby Jason Stanley<br>\n🎧 <small>Finished on <time datetime=\"2019-07-07\">July 7</time></small><br>\n </p>\n</li>\n<li>\n<p><i>How to Disappear: Notes on Invisibility in a Time of Transparency</i><br>\nby Akiko Busch<br>\n🎧 <small>Finished on <time datetime=\"2019-07-12\">July 12</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Thick: And Other Essays </i> ⭐<br>\nby Tressie McMillan Cottom<br>\n📖 <small>Finished on <time datetime=\"2019-07-18\">July 18</time></small><br>\n </p>\n</li>\n<li>\n<p><i>White Fragility: Why It’s So Hard for White People to Talk About Racism </i><br>\nby Robin DiAngelo<br>\n🎧 <small>Finished on <time datetime=\"2019-08-10\">Aug. 10</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Cubed: A Secret History of the Workplace </i> ⭐<br>\nby Nikil Saval<br>\n📖 <small>Finished on <time datetime=\"2019-09-09\">Sept. 9</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Mismatch: How Inclusion Shapes Design </i> ⭐<br>\nby Kat Holmes<br>\n📖 <small>Finished on <time datetime=\"2019-09-14\">Sept. 14</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Biased: Uncovering the Hidden Prejudice That Shapes What We See, Think, and Do </i><br>\nby Jennifer L. Eberhardt<br>\n🎧 <small>Finished on <time datetime=\"2019-09-19\">Sept. 19</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Educated </i><br>\nby Tara Westover<br>\n🎧 <small>Finished on <time datetime=\"2019-10-19\">Oct. 19</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Dream Hoarders: How the American Upper Middle Class Is Leaving Everyone Else in the Dust, Why That Is a Problem, and What to Do About It </i><br>\nby Richard V. Reeves<br>\n📱 <small>Finished on <time datetime=\"2019-11-17\">Nov. 17</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Fallen Founder: The Life of Aaron Burr </i> ⭐<br>\nby Nancy Isenberg<br>\n🎧 <small>Finished on <time datetime=\"2019-12-31\">Dec. 31</time></small><br>\n </p>\n</li>\n</ol>\n",
      "date_published": "2020-01-01T00:00:00Z"
    },{
      "id": "https://nicksimson.com/posts/2018-in-books/",
      "url": "https://nicksimson.com/posts/2018-in-books/",
      "title": "Books finished in 2018",
      "content_html": "<p>In 2018 we bought our first home, a hundred year old house in North Knoxville. I think I listened to more audiobooks in this year becuase of the painting and other jobs that had to be done during my free time...in addition to the walks with the dog.</p>\n<p>As always, this is not a list of endorsements—just an honest list of books I consumed. I will use a ⭐ star emoji to denote books I thoroughly enjoyed or would recommend. I'll also use emoji to denote whether I consumed each item on this list as a 📖 paper book, 📱ebook,  or listened as 🎧 audio.</p>\n<ol>\n<li>\n<p><i>Two-Dimensional Man</i><br>\nby Paul Sahre<br>\n📖 <small>Finished on <time datetime=\"2018-01-04\">Jan. 4</time></small><br>\n </p>\n</li>\n<li>\n<p><i>What You Are Getting Wrong About Appalachia </i> ⭐<br>\nby Elizabeth Catte<br>\n📖 <small>Finished on <time datetime=\"2018-01-06\">Jan. 6</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Oneida: From Free Love Utopia to the Well-Set Table</i><br>\nby Ellen Wayland-Smith<br>\n🎧 <small>Finished on <time datetime=\"2018-01-06\">Jan. 6</time></small><br>\n </p>\n</li>\n<li>\n<p><i>No god but God: The Origins, Evolution and Future of Islam</i><br>\nby Reza Aslan<br>\n🎧 <small>Finished on <time datetime=\"2018-01-14\">Jan. 14</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Tears We Cannot Stop: A Sermon to White America</i><br>\nby Michael Eric Dyson<br>\n🎧 <small>Finished on <time datetime=\"2018-01-16\">Jan. 16</time></small><br>\n </p>\n</li>\n<li>\n<p><i>The Second Coming of the KKK: The Ku Klux Klan of the 1920s and the American Political Tradition</i><br>\nby Linda Gordon<br>\n📱 <small>Finished on <time datetime=\"2018-01-28\">Jan. 28</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Blacks in Appalachia</i><br>\nby William H. Turner<br>\n📖 <small>Finished on <time datetime=\"2018-02-03\">Feb. 3</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Reconstruction: America's Unfinished Revolution 1863-1877</i> ⭐<br>\nby Eric Foner<br>\n🎧 <small>Finished on <time datetime=\"2018-02-05\">Feb. 5</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Blood at the Root: A Racial Cleansing in America</i><br>\nby Patrick Phillips<br>\n🎧 <small>Finished on <time datetime=\"2018-02-15\">Feb. 15</time></small><br>\n </p>\n</li>\n<li>\n<p><i>The Half Has Never Been Told: Slavery and the Making of American Capitalism</i> ⭐<br>\nby Edward E. Baptist<br>\n🎧 <small>Finished on <time datetime=\"2018-02-17\">Feb. 17</time></small><br>\n </p>\n</li>\n<li>\n<p><i>American Culture in the 1950s</i><br>\nby Martin Halliwell<br>\n📱 <small>Finished on <time datetime=\"2018-03-08\">March 8</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Alt-America: The Rise of the Radical Right in the Age of Trump</i><br>\nby David Neiwert<br>\n📱 <small>Finished on <time datetime=\"2018-03-29\">March 29</time></small><br>\n </p>\n</li>\n<li>\n<p><i>The Evangelicals: The Struggle to Shape America</i><br>\nby Frances FitzGerald<br>\n🎧 <small>Finished on <time datetime=\"2018-04-02\">April 2</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Democracy in Chains: The Deep History of the Radical Right's Stealth Plan for America</i> ⭐<br>\nby Nancy MacLean<br>\n🎧 <small>Finished on <time datetime=\"2018-04-10\">April 10</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Life in Code: A Personal History of Technology</i> ⭐<br>\nby Ellen Ullman<br>\n📖 <small>Finished on <time datetime=\"2018-04-12\">April 12</time></small><br>\n </p>\n</li>\n<li>\n<p><i>The Idea Factory: Bell Labs and the Great Age of American Innovation</i> ⭐<br>\nby Jon Gertner<br>\n🎧 <small>Finished on <time datetime=\"2018-04-21\">April 21</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Knowledge for Sale: The Neoliberal Takeover of Higher Education</i><br>\nby Lawrence Busch<br>\n📖 <small>Finished on <time datetime=\"2018-04-29\">April 29</time></small><br>\n </p>\n</li>\n<li>\n<p><i>White Rage: The Unspoken Truth of Our Racial Divide</i> ⭐<br>\nby Carol Anderson<br>\n🎧 <small>Finished on <time datetime=\"2018-05-01\">May 1</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Live Work Work Work Die: A Journey into the Savage Heart of Silicon Valley</i> ⭐<br>\nby Corey Pein<br>\n🎧 <small>Finished on <time datetime=\"2018-05-05\">May 5</time></small><br>\n </p>\n</li>\n<li>\n<p><i>The Underground Railroad</i><br>\nby Colson Whitehead<br>\n🎧 <small>Finished on <time datetime=\"2018-05-08\">May 8</time></small><br>\n </p>\n</li>\n<li>\n<p><i>A Confederacy of Dunces</i> ⭐<br>\nby John Kennedy Toole<br>\n🎧 <small>Finished on <time datetime=\"2018-05-19\">May 19</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Breakfast of Champions</i><br>\nby Kurt Vonnegut Jr.<br>\n🎧 <small>Finished on <time datetime=\"2018-05-28\">May 28</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Cat's Cradle</i> ⭐<br>\nby Kurt Vonnegut Jr.<br>\n🎧 <small>Finished on <time datetime=\"2018-06-03\">June 3</time></small><br>\n </p>\n</li>\n<li>\n<p><i>The Invisible Bridge: The Fall of Nixon and the Rise of Reagan</i> ⭐<br>\nby Rick Perlstein<br>\n🎧 <small>Finished on <time datetime=\"2018-06-06\">June 6</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Octavia Butler's Kindred: A Graphic Novel Adaptation</i><br>\nAdapted by Damian Duffy and John Jennings<br>\n📱 <small>Finished on <time datetime=\"2018-06-08\">June 8</time></small><br>\n </p>\n</li>\n<li>\n<p><i>The Plot Against America</i><br>\nby Philip Roth<br>\n🎧 <small>Finished on <time datetime=\"2018-06-20\">June 20</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Slaughterhouse-Five </i> ⭐<br>\nby Kurt Vonnegut Jr.<br>\n🎧 <small>Finished on <time datetime=\"2018-06-23\">June 23</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Batman: Year One</i><br>\nby Frank Miller<br>\n📱 <small>Finished on <time datetime=\"2018-06-27\">June 27</time></small><br>\n </p>\n</li>\n<li>\n<p><i>The Hacking of the American Mind: The Science Behind the Corporate Takeover of Our Bodies and Brains</i><br>\nby Robert H. Lustig<br>\n🎧 <small>Finished on <time datetime=\"2018-06-28\">June 28</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Sing, Unburied, Sing</i> ⭐<br>\nby Jesmyn Ward<br>\n🎧 <small>Finished on <time datetime=\"2018-06-30\">June 30</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Sourdough </i><br>\nby Robin Sloan<br>\n🎧 <small>Finished on <time datetime=\"2018-07-02\">July 2</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Mr. Penumbra's 24-Hour Bookstore</i><br>\nby Robin Sloan<br>\n🎧 <small>Finished on <time datetime=\"2018-07-03\">July 3</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Bible Nation: The United States of Hobby Lobby</i><br>\nby Candida R. Moss and Joel S. Baden<br>\n📖 <small>Finished on <time datetime=\"2018-07-13\">July 13</time></small><br>\n </p>\n</li>\n<li>\n<p><i>The Color of Law: A Forgotten History of How Our Government Segregated America</i> ⭐<br>\nby Richard Rothstein<br>\n🎧 <small>Finished on <time datetime=\"2018-07-19\">July 19</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Glass House: The 1% Economy and the Shattering of the All-American Town</i><br>\nby Brian Alexander<br>\n🎧 <small>Finished on <time datetime=\"2018-08-03\">Aug. 3</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Information Doesn't Want to Be Free: Laws for the Internet Age</i> ⭐<br>\nby Cory Doctorow<br>\n📱 <small>Finished on <time datetime=\"2018-08-04\">Aug. 4</time></small><br>\n </p>\n</li>\n<li>\n<p><i>The Mushroom at the End of the World: On the Possibility of Life in Capitalist Ruins</i><br>\nby Anna Lowenhaupt Tsing<br>\n📖 <small>Finished on <time datetime=\"2018-08-09\">Aug. 9</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Kids These Days: Human Capital and the Making of Millennials </i><br>\nby Malcolm Harris<br>\n📖 <small>Finished on <time datetime=\"2018-09-11\">Sept. 11</time></small><br>\n </p>\n</li>\n<li>\n<p><i>When Affirmative Action Was White: An Untold History of Racial Inequality in Twentieth-Century America</i><br>\nby Ira Katznelson<br>\n🎧 <small>Finished on <time datetime=\"2018-09-11\">Sept. 11</time></small><br>\n </p>\n</li>\n<li>\n<p><i>The Chapo Guide to Revolution: A Manifesto Against Logic, Facts, and Reason</i><br>\nby Chapo Trap House<br>\n📖 <small>Finished on <time datetime=\"2018-10-16\">Oct. 16</time></small><br>\n </p>\n</li>\n<li>\n<p><i>The Reactionary Mind: Conservatism from Edmund Burke to Donald Trump</i> ⭐<br>\nby Corey Robin<br>\n🎧 <small>Finished on <time datetime=\"2018-11-18\">Nov. 18</time></small><br>\n </p>\n</li>\n<li>\n<p><i>How to Speak Midwestern</i><br>\nby Edward McClelland<br>\n📖 <small>Finished on <time datetime=\"2018-12-20\">Dec. 20</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Seeing Is Forgetting the Name of the Thing One Sees: A Life of Contemporary Artist Robert Irwin</i><br>\nby Lawrence Weschler<br>\n📖 <small>Finished on <time datetime=\"2018-12-26\">Dec. 26</time></small><br>\n </p>\n</li>\n<li>\n<p><i>New Dark Age: Technology and the End of the Future</i><br>\nby James Bridle<br>\n📱 <small>Finished on <time datetime=\"2018-12-29\">Dec. 29</time></small><br>\n </p>\n</li>\n</ol>\n",
      "date_published": "2019-01-01T00:00:00Z"
    },{
      "id": "https://nicksimson.com/posts/2017-in-books/",
      "url": "https://nicksimson.com/posts/2017-in-books/",
      "title": "Books finished in 2017",
      "content_html": "<p>In trying to understand this current moment historically, my reading interests skewed sharply toward books on power and politics beginning in late 2016. I wonder how common that is during elections, or during a presidential transition.</p>\n<p>I continue to <a href=\"https://www.goodreads.com/nsmsn\">track my reading activity with Goodreads</a>. In 2017, I discovered Overdrive, an ebook and audiobook service available at my local public library. I was using Audible (the one credit every other month subscription) and the addition of this app accelerated by audiobook consumption. I also took several long car trips in 2017 and stayed entertained with some of the audio titles.</p>\n<p>I tend to keep multiple books going at a time, reading paper during the day, an e-reader at night, and listening to audiobooks while waiting on the bus, walking the dog, or washing the dishes after dinner.</p>\n<p>Again, not all of these books are endorsements. I did read a bunch of recent bestseller or zeitgeist-y books, but these were not necessarily my favorites. I'll use a ⭐ star emoji to denote books I thoroughly enjoyed or would recommend. I'll also use emoji to denote whether I read each item on this list as a 📖 paper book, 📱ebook,  or listened as 🎧 audio.</p>\n<ol>\n<li>\n<p><i>The Reactionary Mind: Conservatism from Edmund Burke to Sarah Palin </i> ⭐<br>\nby Corey Robin<br>\n📱 <small>Finished on <time datetime=\"2017-01-03\">Jan. 3</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Evicted: Poverty and Profit in the American City</i> ⭐<br>\nby Matthew Desmond<br>\n📖 <small>Finished on <time datetime=\"2017-02-02\">Feb. 2</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Dark Money: The Hidden History of the Billionaires Behind the Rise of the Radical Right </i><br>\nby Jane Mayer<br>\n🎧 <small>Finished on <time datetime=\"2017-02-07\">Feb. 7</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Between the World and Me </i><br>\nby Ta-Nehisi Coates<br>\n🎧 <small>Finished on <time datetime=\"2017-02-07\">Feb. 7</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Seinfeldia: How a Show about Nothing Changed Everything</i><br>\nby Jennifer Keishin Armstrong<br>\n🎧 <small>Finished on <time datetime=\"2017-02-11\">Feb. 11</time></small><br>\n </p>\n</li>\n<li>\n<p><i>The Power Broker: Robert Moses and the Fall of New York </i> ⭐<br>\nby Robert A. Caro<br>\n🎧 <small>Finished on <time datetime=\"2017-03-26\">March 26</time></small><br>\n </p>\n</li>\n<li>\n<p><i>The Flintstones, Vol. 1 </i><br>\nby Mark Russell and Steve Pugh<br>\n📖 <small>Finished on <time datetime=\"2017-04-05\">April 5</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Design: The Invention of Desire</i><br>\nby Jessica Helfand<br>\n📖 <small>Finished on <time datetime=\"2017-04-10\">April 10</time></small><br>\n </p>\n</li>\n<li>\n<p><i>The True Believer: Thoughts on the Nature of Mass Movements </i><br>\nby Eric Hoffer<br>\n📖 <small>Finished on <time datetime=\"2017-04-12\">April 12</time></small><br>\n </p>\n</li>\n<li>\n<p><i> On Tyranny: Twenty Lessons from the Twentieth Century</i><br>\nby Timothy Snyder<br>\n📖 <small>Finished on <time datetime=\"2017-04-23\">April 23</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Jesus and Nonviolence: A Third Way </i><br>\nby Walter Wink<br>\n📖 <small>Finished on <time datetime=\"2017-04-23\">April 23</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Hillbilly Elegy: A Memoir of a Family and Culture in Crisis </i><br>\nby J.D. Vance<br>\n🎧 <small>Finished on <time datetime=\"2017-04-27\">April 27</time></small><br>\n </p>\n</li>\n<li>\n<p><i>The Information: A History, a Theory, a Flood</i> ⭐<br>\nby James Gleick<br>\n<small>Finished on <time datetime=\"2017-04-27\">April 27</time></small><br>\n </p>\n</li>\n<li>\n<p><i>The Fire Next Time</i> ⭐<br>\nby James Baldwin<br>\n🎧 <small>Finished on <time datetime=\"2017-04-28\">April 28</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Seven Brief Lessons on Physics </i><br>\nby Carlo Rovelli<br>\n🎧 <small>Finished on <time datetime=\"2017-04-29\">April 29</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Blackballed: The Black and White Politics of Race on America's Campuses</i><br>\nby Lawrence Ross<br>\n📖 <small>Finished on <time datetime=\"2017-05-03\">May 3</time></small><br>\n </p>\n</li>\n<li>\n<p><i>The Selfishness of Others: An Essay on the Fear of Narcissism </i><br>\nby Kristin Dombek<br>\n📖 <small>Finished on <time datetime=\"2017-05-13\">May 13</time></small><br>\n </p>\n</li>\n<li>\n<p><i>CivilWarLand in Bad Decline </i> ⭐<br>\nby George Saunders<br>\n📖 <small>Finished on <time datetime=\"2017-05-21\">May 21</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Lower Ed: The Troubling Rise of For-Profit Colleges in the New Economy </i> ⭐<br>\nby Tressie McMillan Cottom<br>\n📖 <small>Finished on <time datetime=\"2017-05-22\">May 22</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Bad Feminist </i><br>\nby Roxane Gay<br>\n🎧 <small>Finished on <time datetime=\"2017-07-11\">July 11</time></small><br>\n </p>\n</li>\n<li>\n<p><i>America's War for the Greater Middle East </i> ⭐<br>\nby Andrew J. Bacevich<br>\n📖 <small>Finished on <time datetime=\"2017-07-22\">July 22</time></small><br>\n </p>\n</li>\n<li>\n<p><i>The Money Cult: Capitalism, Christianity, and the Unmaking of the American Dream</i><br>\nby Chris Lehmann<br>\n📖 <small>Finished on <time datetime=\"2017-07-26\">July 26</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Culture as Weapon: Art and Marketing in the Age of Total Communication </i><br>\nby Nato Thompson<br>\n📖 <small>Finished on <time datetime=\"2017-07-30\">July 30</time></small><br>\n </p>\n</li>\n<li>\n<p><i>The Big Short: Inside the Doomsday Machine </i><br>\nby Michael Lewis<br>\n🎧 <small>Finished on <time datetime=\"2017-08-13\">Aug. 13</time></small><br>\n </p>\n</li>\n<li>\n<p><i>The New Jim Crow: Mass Incarceration in the Age of Colorblindness </i>⭐<br>\nby Michelle Alexander<br>\n🎧 <small>Finished on <time datetime=\"2017-08-25\">Aug. 25</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Lafayette in the Somewhat United States </i><br>\nby Sarah Vowell<br>\n🎧 <small>Finished on <time datetime=\"2017-09-02\">Sept. 2</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Utopia Drive: A Road Trip Through America's Most Radical Idea </i><br>\nby Erik Reece<br>\n📖 <small>Finished on <time datetime=\"2017-09-05\">Sept. 5</time></small><br>\n </p>\n</li>\n<li>\n<p><i>A Mother's Reckoning: Living in the Aftermath of Tragedy </i><br>\nby Sue Klebold<br>\n📖 <small>Finished on <time datetime=\"2017-09-16\">Sept. 16</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Men Explain Things to Me</i><br>\nby Rebecca Solnit<br>\n📖 <small>Finished on <time datetime=\"2017-09-18\">Sept. 18</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Lincoln in the Bardo </i> ⭐<br>\nby George Saunders<br>\n🎧 <small>Finished on <time datetime=\"2017-09-24\">Sept. 24</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Al Franken: Giant of the Senate </i><br>\nby Al Franken<br>\n🎧 <small>Finished on <time datetime=\"2017-09-29\">Sept. 29</time></small><br>\n </p>\n</li>\n<li>\n<p><i> White Lies: Race, Class, Gender and Sexuality in White Supremacist Discourse</i><br>\nby Jessie Daniels<br>\n📖 <small>Finished on <time datetime=\"2017-10-08\">Oct. 8</time></small><br>\n </p>\n</li>\n<li>\n<p><i>What Is the Bible?: How an Ancient Library of Poems, Letters, and Stories Can Transform the Way You Think and Feel About Everything</i><br>\nby Rob Bell<br>\n📖 <small>Finished on <time datetime=\"2017-10-11\">Oct. 11</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Krazy: The Black and White World of George Herriman </i>  ⭐<br>\nby Michael Tisserand<br>\n📖 <small>Finished on <time datetime=\"2017-11-06\">Nov. 6</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Against Everything: Essays</i><br>\nby Mark Greif<br>\n📖 <small>Finished on <time datetime=\"2017-11-11\">Nov. 11</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Guyland: The Perilous World Where Boys Become Men </i><br>\nby Michael S. Kimmel<br>\n📖 <small>Finished on <time datetime=\"2017-11-12\">Nov. 12</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Fantasyland: How America Went Haywire: A 500-Year History</i><br>\nby Kurt Andersen<br>\n🎧 <small>Finished on <time datetime=\"2017-11-23\">Nov. 23</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Resilient Web Design</i><br>\nby Jeremy Keith<br>\n📱 <small>Finished on <time datetime=\"2017-11-29\">Nov. 29</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Stamped from the Beginning: The Definitive History of Racist Ideas in America </i><br>\nby Ibram X. Kendi<br>\n📖 <small>Finished on <time datetime=\"2017-12-29\">Dec. 29</time></small><br>\n </p>\n</li>\n</ol>\n",
      "date_published": "2018-01-01T00:00:00Z"
    },{
      "id": "https://nicksimson.com/posts/2016-in-books/",
      "url": "https://nicksimson.com/posts/2016-in-books/",
      "title": "Books finished in 2016",
      "content_html": "<p>In 2015 I became a dog guardian for the first time. Zelda is still a young pup and requires a lot of walking, so audiobooks are becoming my new friend. I expect I will be listening to a lot more in 2017.</p>\n<p>I should also mention that these are not all endorsements, just books I finished. The ones I really liked and would recommend will be marked with a ⭐ star emoji.</p>\n<p>In addition of keeping track of what I read, I'll also use emoji to denote whether I read this as a 📖 paper book, 📱ebook/PDF,  or listened as 🎧 audio.</p>\n<ol>\n<li>\n<p><i>A Matter of Breeding: A Biting History of Pedigree Dogs and How the Quest for Status Has Harmed Man's Best Friend</i><br>\nby Michael Brandow<br>\n📖 <small>Finished on <time datetime=\"2016-01-03\">Jan. 3</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Bartleby the Scrivener</i><br>\nby Herman Melville<br>\n📱 <small>Finished on <time datetime=\"2016-01-03\">Jan. 3</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Give Us the Ballot: The Modern Struggle for Voting Rights in America</i> ⭐<br>\nby Ari Berman<br>\n📖 <small>Finished on <time datetime=\"2016-03-13\">March 13</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Content Strategy for WordPress</i><br>\nby Stephanie Leary<br>\n📱 <small>Finished on <time datetime=\"2016-03-17\">March 17</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Do What You Love and Other Lies About Success and Happiness</i><br>\nby Miya Tokumitsu<br>\n📖 <small>Finished on <time datetime=\"2016-04-27\">April 27</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Benching Jim Crow: The Rise and Fall of the Color Line in Southern College Sports, 1890-1980</i> ⭐<br>\nby Charles H. Martin<br>\n📖 <small>Finished on <time datetime=\"2016-05-20\">May 20</time></small><br>\n </p>\n</li>\n<li>\n<p><i>American Character: A History of the Epic Struggle Between Individual Liberty and the Common Good</i><br>\nby Colin Woodard<br>\n📖 <small>Finished on <time datetime=\"2016-06-18\">June 18</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Searching for Sunday: Loving, Leaving, and Finding the Church </i><br>\nby Rachel Held Evans<br>\n📖 <small>Finished on <time datetime=\"2016-06-26\">June 26</time></small><br>\n </p>\n</li>\n<li>\n<p><i>What We See When We Read </i><br>\nby Peter Mendelsund<br>\n📖 <small>Finished on <time datetime=\"2016-07-02\">July 2</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Democracy in Black: How Race Still Enslaves the American Soul </i> ⭐<br>\nby Eddie S. Glaude<br>\n📖 <small>Finished on <time datetime=\"2016-07-22\">July 22</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Love Wins</i><br>\nby Rob Bell<br>\n📖 <small>Finished on <time datetime=\"2016-08-10\">Aug. 10</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Adaptive Web Design: Crafting Rich Experiences with Progressive Enhancement </i> ⭐<br>\nby Aaron Gustafson<br>\n📖 <small>Finished on <time datetime=\"2016-08-24\">Aug. 24</time></small><br>\n </p>\n</li>\n<li>\n<p><i>On Inequality </i><br>\nby Harry G. Frankfurt<br>\n📖 <small>Finished on <time datetime=\"2016-08-26\">Aug. 26</time></small><br>\n </p>\n</li>\n<li>\n<p><i>White Trash: The 400-Year Untold History of Class in America </i> ⭐<br>\nby Nancy Isenberg<br>\n🎧 <small>Finished on <time datetime=\"2016-10-24\">Oct. 24</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Nixonland: The Rise of a President and the Fracturing of America </i> ⭐<br>\nby Rick Perlstein<br>\n📖 <small>Finished on <time datetime=\"2016-11-07\">Nov. 7</time></small><br>\n </p>\n</li>\n<li>\n<p><i>Weapons of Math Destruction: How Big Data Increases Inequality and Threatens Democracy </i><br>\nby Cathy O'Neil<br>\n🎧 <small>Finished on <time datetime=\"2016-11-13\">Nov. 13</time></small><br>\n </p>\n</li>\n<li>\n<p><i>The Dream Life of Astronauts </i> ⭐<br>\nby Patrick Ryan<br>\n📖 <small>Finished on <time datetime=\"2016-12-11\">Dec. 11</time></small><br>\n </p>\n</li>\n</ol>\n",
      "date_published": "2017-01-02T00:00:00Z"
    },{
      "id": "https://nicksimson.com/posts/2016-adaptive-web-design/",
      "url": "https://nicksimson.com/posts/2016-adaptive-web-design/",
      "title": "JavaScript is not your interface.",
      "content_html": "<p class=\"lede\">It&rsquo;s just one powerful layer that can do some incredible things on an already solid HTML&nbsp;foundation.</p>\n<p><a href=\"http://adaptivewebdesign.info/\"><img class=\"book\" src=\"/img/post-images/adaptive-web-cover.jpg\" alt=\"Cover of Adaptive Web Design\" /></a></p>\n<p><a href=\"http://adaptivewebdesign.info/\"><em>Adaptive Web Design</em></a> is an excellent guide to creating rich digital experiences for the web. The author, <a href=\"https://www.aaron-gustafson.com/\">Aaron Gustafson</a>, is a seasoned web professional who really knows his stuff. More than a framework or methodology, Gustafson introduces Progressive Enhancement as a guiding &quot;philosophy&quot; to approaching websites and apps, treating each part of the design process as a series of layers upon a universally accessible, baseline experience.</p>\n<p>Progressive enhancement, when done right, will provide a base level support for ancient technology, while supporting new devices that have not been invented yet, as well as screen readers and other assistive technology. In my own professional experience, I've found that going back to retrofit existing sites I designed to fix accessibility issues is a time and labor-consuming, but worthwhile process. Knowing what I know now, I will be employing a progressive enhancement approach on every new project I take on.</p>\n<p>The book is organized into short chapters (layers) on content strategy, HTML, WAI-ARIA, CSS, and JavaScript (in that order). Gustafson includes many clever code snippets in the text itself for examples of progressive enhancement and performance strategies. The Second Edition is up-to-date with web standards, modern browser behavior, and offline storage information. I read the print edition, which includes <a href=\"http://perma.cc\">perma.cc</a> shortlinks (archived with the Internet Archive) of well-documented hypertext examples. There are seven video examples included as figures in the digital edition that can be viewed on the <a href=\"http://adaptivewebdesign.info/2nd-edition/videos/\">book's website</a>.</p>\n<p>This tome sits alongside my various <a href=\"http://rosenfeldmedia.com/\">Rosenfeld Media</a> and <a href=\"http://abookapart.com/\">A Book Apart</a> titles – books with similar dimensions I find helpful to go back and refer to every few months. A web designer with a few years of experience will get a lot of ideas and inspiration from the text and examples, but I would recommend it for beginners as well, alongside Jennifer Robbins’ <a href=\"http://www.learningwebdesign.com/\"><em>Learning Web Design</em></a>.</p>\n<p> </p>\n<mark>\n<small><em>This is a cross-posting of a book I reviewed on <a href=\"https://www.amazon.com/gp/review/R3MB2MRMDDLDCW?ref_=glimp_1rv_cl\">Amazon.com</a> and&nbsp;<a href=\"https://www.goodreads.com/book/show/28095620-adaptive-web-design\">Goodreads</a>. </em></small>\n</mark>\n",
      "date_published": "2016-09-10T00:00:00Z"
    },{
      "id": "https://nicksimson.com/posts/2016-many-best-practices/",
      "url": "https://nicksimson.com/posts/2016-many-best-practices/",
      "title": "Many best practices",
      "content_html": "<p>I recently stumbled across a website called <a href=\"http://webfieldmanual.com/\">Web Field Manual</a>, a directory of resources &quot;focused on documenting only the best knowledge for designing experiences and interfaces on the web.&quot;</p>\n<p>The directory features a ton of links to information sources on relevant front-end web design topics: design process, style guide documentation, grids and typography, accessibility, and specific web technologies. Many of the articles and projects linked here I was familiar with, but several are new to me as well.</p>\n<p>No single link or author is the authoritative end-point for a particular subject. Combined, all these approaches make up a useful body of knowledge. Here are a few recent things I've discovered that are currently influencing or changing my web design approach:</p>\n<h2 id=\"itcss\"><a href=\"http://itcss.io\">ITCSS</a> <a class=\"direct-link\" href=\"#itcss\">#</a></h2>\n<p>Short for <em>Inverted Triangle Cascading Stylesheets</em>, an approach to CSS architecture coined by Harry Roberts that is more strategy than strict methodology. ITCSS is primarily concerned with avoiding a needless complexity throughout the cascade by keeping the broadest, most reusable rules at the beginning of the file and finishes with the most specific rules (style overrides) at the end.</p>\n<p><a href=\"https://medium.com/@jordankoschei/how-i-shrank-my-css-by-84kb-by-refactoring-with-itcss-2e8dafee123a#.es1uf4lio\">Jordan Koschei wrote an informative article</a> detailing how he refactored his own website styles using ITCSS, and how this shrank the file size of his final stylesheet and boosted his web performance. The <a href=\"https://www.xfive.co/blog/itcss-scalable-maintainable-css-architecture/\">Xfive blog also recently published a helpful overview</a>. The ITCSS strategy can be easily combined with other CSS architecture approaches, such as SMACSS, OOCSS, or BEM. I'm currently applying the ITCSS approach on a side project, and have already found it both useful and efficient for naming and organizing my CSS files.</p>\n<h2 id=\"fluid%2C-mathematical-web-typography\"><a href=\"https://jxnblk.com/blog/mathematical-web-typography/\">Fluid, Mathematical Web Typography</a> <a class=\"direct-link\" href=\"#fluid%2C-mathematical-web-typography\">#</a></h2>\n<p><a href=\"https://jxnblk.com/blog/mathematical-web-typography/\">This post by Brent Jackson</a> builds upon previous writing on <a href=\"http://typecast.com/blog/a-more-modern-scale-for-web-typography\">modular scale typesetting</a> by others, proposing a simple set of rules to make type on the web infinitely scaleable and fluid, instead of relying on context-driven &quot;magic numbers&quot;. A potentially infinite canvas throws a wrench into the historic conventions of typesetting, where rules have been built on fixed dimensions for centuries.</p>\n<p>Michael Riethmuller wrote more recently on <a href=\"https://www.smashingmagazine.com/2016/05/fluid-typography/\">fluid typography with viewport units</a>. In this instance, &quot;fluid&quot; web type also means that there is no maximum <code>font-size</code> property, but the font system is sized in relationship to the overall canvas size. Responsive web design (largely) solved the designer dilemma for the mass adoption of smaller screens, but the <a href=\"http://caniuse.com/#feat=viewport-units\">increasing support</a> of viewport units and a typescale that increases exponentially could better <a href=\"https://css-tricks.com/optimizing-large-scale-displays/\">optimize our designs for larger screens</a>.</p>\n<h2 id=\"progressive-enhancement-everywhere\"><a href=\"https://www.nngroup.com/articles/enhancement/\">Progressive Enhancement Everywhere</a> <a class=\"direct-link\" href=\"#progressive-enhancement-everywhere\">#</a></h2>\n<p>The term <em>progressive enhancement</em>, coined around 2003, is not new, but I think its adoption and popularity will only trend upward. Voice-based user interfaces and artificial intelligence  I've become more fully aware of the concept by following the work of Jeremy Keith and Aaron Gustafson. I'm currently reading and enjoying Gustafson's <a href=\"http://adaptivewebdesign.info/\"><em>Adaptive Web Design</em> book</a>, in which he describes interaction design as a series of enhancement layers built on top of a foundation of raw content and information:</p>\n<ol>\n<li>Markup (HTML, WAI-ARIA) is an enhancement layer, giving semantic structure to the content elements and exposing meaning to assistive technologies;</li>\n<li>Visual Design (Images, CSS, animations) is an enhancement layer, guiding the audience with visual prompts, identity, and delight;</li>\n<li>Interaction (Javascript) is the final enhancement layer, esablishing a baseline experience and fallbacks for interactions in which none, or only some of the programming is executed.</li>\n</ol>\n<p>Developing with this approach means that your content, service, and intention reaches the widest possible audience and accepts a broad and ever-increasing spectrum of input types and device capabilities—an exetension of the diversity of the human population itself and the human experience in the information age.</p>\n",
      "date_published": "2016-06-11T00:00:00Z"
    },{
      "id": "https://nicksimson.com/posts/2015-becoming-an-everyday-developer/",
      "url": "https://nicksimson.com/posts/2015-becoming-an-everyday-developer/",
      "title": "Becoming an everyday developer",
      "content_html": "<p>A week ago <a href=\"http://nicksimson.com/everyday-developers/\">I shared a few highlights and my impressions</a> from a recent Web Ahead discussion about &quot;everyday developers&quot;. I made the point that web development is not a monolith: There are a lot of different kinds of websites, there are a ton of different tools and ways to deploy a site, and noone should be expected to know everything.</p>\n<p>I wanted to write a follow-up entry with more details about the learning path toward becoming a web designer or developer, and I had a beginner in mind as I started drafting this post. It can be difficult to know where to start learning. It can be diffciult to figure out what to learn next. This isn't a prescriptive or definitive career guide, just what I think the core compenties are, other skills that can come in handy, and the best order to learn them in. I will not recommend any specific frameworks, software, or tools, save for two books and a handful of reference websites.</p>\n<p>The definition of &quot;everyday developer&quot; I am working with is someone who writes <strong>front-end code</strong>—that is, HTML, CSS, Javascript—to create websites for clients, either as a freelancer or an employee on a small team. I am not referring to game developers, other application platform developers, back-end programmer, or engineer wirking on a huge web product (like Facebook or Netflix). This definition also excludes industry experts and conference speakers. There may be some overlap in these worlds, but I have a web developer focused on content-based sites in mind. As I use the terms &quot;everyday developer&quot; , &quot;web designer&quot;, or &quot;front-end developer&quot; in this post, this is who I am referring to.</p>\n<h2 id=\"learning-how-to-learn\">Learning How to Learn <a class=\"direct-link\" href=\"#learning-how-to-learn\">#</a></h2>\n<p>There are two things required to pick up new skills: an awareness of the thing you want/need to learn, and the motivation to do the work necessary to learn the new thing. Proficiency is gained through practice and repetition of the new skills, and tackling harder problems. Mastery is achieved by developing an awareness of what you need to learn next, and repeating this process.</p>\n<p>There are lots of references guides and lessons available for learning web technologies, and what you use will depend on how you learn best. My preference has always been with reading, and I usually prefer books over screencasts and videos. I have picked up new things quickly with both <a href=\"http://teamtreehouse.com\">Treehouse</a> and <a href=\"http://lynda.com\">Lynda.com</a>, but I like to have a good reference book handy.</p>\n<p>If you are only going to buy one book to learn basic web development, I recommend <a href=\" http://www.learningwebdesign.com/\"><em>Learning Web Design</em>, by Jennifer Robbins</a>. It is 600 pages and $50. Its a textbook, so its updated often, and was designed with web design classes taught at community colleges and universities in mind. You can find many high-quality short books for cheaper, but I find they often only cover a small amount or a very specific area in what is a multidisciplinary world. A lot of the smaller books are written for intermediate, or everyday developers, so they may quickly cover or review some basic concepts, but not at the broad, introductory level you need to understand now.</p>\n<p>The world of web development changes often, so sometimes there are things so new, the book hasn't been written on it yet. This is where I turn to blog posts. I rely on a few trusted sources: <a href=\"http://www.sitepoint.com/\">Sitepoint</a>, <a href=\"http://alistapart.com\">A List Apart</a>, and <a href=\"http://smashingmagazine.com\">Smashing Magazine</a>. These are popular sources, but reliable. Their business models focus on quality over quantity. All three websites compensate their writers and hire technical editors.</p>\n<p><strong>A note about tutorials:</strong> I think its OK to start with one or two tutorials if everything feels foreign to you, but you are going to learn better and be more invested if it can be adapted into a real project you find interesting or rewarding. Again, its about the motivation to learn new things. This is how I use tutorials today.</p>\n<p>Finally, just as a web developer can't be expected to everything, you don't need to learn everything at once. I'll try to highlight what I think are the most important things to learn and pick up on the way to becoming an everyday developer.</p>\n<h2 id=\"core-competencies\">Core Competencies <a class=\"direct-link\" href=\"#core-competencies\">#</a></h2>\n<p>With so much room for specialization, the professional developer should be primarily fluent in the three front-end technologies the end user will interact with: HTML, CSS, and Javascript. Start with these. In that order. The most effective method I've found is to use a lesson that requires you to write the HTML markup first, create a layout and aesthetic layer on top with CSS, and add a little basic interaction with simple Javascript or customizing variables in a jQuery plugin. This is the foundation for everything else.</p>\n<p>You don't need to know every part of the spec to start using HTML. I use this screenshot from a <a href=\"http://www.dontfeartheinternet.com/02-html/\">Don't Fear the Internet video</a> to show others which HTML tags they actually need to know to begin structuring web documents:</p>\n<figure>\n<a href=\"http://www.dontfeartheinternet.com/02-html/\">\n<img src=\"/images/post-images/2015-09-07-dont-fear.png\" alt=\"Screenshot of all html tags with a few highlighted\" /></a>\n<figcaption>\nScreencapture of video content &copy; Jessica Hische &amp; Russ Maschmeyer</figcaption>\n</figure>\n<p>I think CSS can be a fun language for people approaching it from graphic design and a frustrating one for people approaching it from programming. I would recommend the <a href=\"https://css-tricks.com/almanac/\">CSS-Tricks Almanac</a> and the <a href=\"http://reference.sitepoint.com/css\">Sitepoint CSS reference</a> for people new to CSS</p>\n<p>Next, learn how to deploy a website. It really doesn’t matter if its FTP, command-line, a hosted CMS or a Dropbox folder. There are so many ways to deploy a website, and her I would just recommend reading the instructions, following them carefully, and if you still don’t understand, pick a different method.</p>\n<p>As you are learning HTML, CSS, and Javascript and deploying your files to the server, two important concepts to pick up on are accessibility and progressive enhancement. A lot of web designers are not familiar with these terms but already practice them in their development process.</p>\n<h2 id=\"accessibility\">Accessibility <a class=\"direct-link\" href=\"#accessibility\">#</a></h2>\n<p>Accessibility is not just designing for people with disabilities. Many of the following practices will make your products more universally usable and may even improve your search engine optimization.</p>\n<p>The HTML spec already has so much accessibility baked into it. As long as you are already writing structured, semantic HTML and providing textual alternatives for non-text content, you're on your way there. The easiest things to mess up accessibility-wise in HTML are probably the <code>form</code>, <code>button</code>, and <code>input</code> tags. Read up on the ARIA roles, and keep the <a href=\"http://a11yproject.com/checklist.html\">Accessibility Project</a> open in your browser tabs for reference when working on your projects.</p>\n<p>In CSS, you can't specify alt text, so make sure you are only using the <code>background-image</code> property for decoration, not contextual images with meaning. Read up on colorblindness, and install an app or browser add-on that simulates different types of colorblindness and low-vision conditions so you are providing the best possible viewing experience in your design decisions.</p>\n<p>If you are including interactive content, multimedia, animation or visualizations, try to use a library that supports multiple inputs: touchscreens, mouse, and keyboard. Don't use autoplaying audio, video, or slideshows without start and stop controls. If you have complex site navigation, consider adding 'skip to main content' or 'skip to navigation' links near the top of your HTML document</p>\n<p>Accessibility is more of a mindset that a handful of techniques. Learn how others navigate the web. Try to step inside their shoes. If you have a phone or tablet with accessibility features and a web browser, try turning these on and attempt to navigate the web by voice only, or with your eyes shut. If you want to go deeper, install the free NVDA-JAWS reader and learn how to navigate the web with it.</p>\n<h2 id=\"progressive-enhancement\">Progressive Enhancement <a class=\"direct-link\" href=\"#progressive-enhancement\">#</a></h2>\n<p>Progressive enhancement is about delivering a user experience free of technological restrictions. There are a variety of devices, browsers and technologies all hitting the same website. Not all are in ideal conditions, and very few scenarios match the exact environment in which it was developed. The website does not need to look the same in each browser, but the basic experience (connection is made, text content is displayed) is consistent. If the technology fails to render the javascript or CSS, can a user still interact with the content?</p>\n<p>The other part of enhancement is delivering appropriate fallbacks for features not supported by every technology. Its not about making the website look the same in each browser, but making sure the content and information are readable and accessible, and the experience is consistent to what the user is accustomed to seeing. This concept is the key to fault tolerance and longevity on the web.</p>\n<h2 id=\"other-technical-skills\">Other Technical Skills <a class=\"direct-link\" href=\"#other-technical-skills\">#</a></h2>\n<p>Once you know your HTML, CSS and Javascript, and can get these files to your server, what should you learn next? I would suggest Git or some command line stuff or a template language. Git is a version control for software development (a little like track changes in Microsoft Word), that a lot of teams and open source projects use.</p>\n<p>To be a good, useful generalist, it is important to have a thorough understanding of the fundamentals, followed by a surface level understanding of most things related to the role. Again, the goal is not to know everything. All of the following are useful for everyday developers to be aware of, and also represent potential paths toward specialization:</p>\n<p>I wrote last week that the content management system is still the bread-and-butter of the everyday developer. Which ones you learn and how deep you go depends on what you want to get out of it, who you want to work for, and how much more you are willing to learn. I won't offer much advice here except pick something popular, well-documented and widely supported, and your life will be easier. The <a href=\"https://mijingo.com/podcast/\">CMS Chronicles</a> mini-podcast might help if you are trying to find a good fit.</p>\n<p>I don’t think an everyday developer needs to become a database expert. Not every website needs a complex database structure or server-side technology. Static sites are becoming very popular for a good reason: they are quick to build and deploy, cheaper to host, and often more performant for the end user. A working knowledge of the basics is helpful, but if you are just starting out or only interested in working on the front-end, this is probably not something you need to focus on today.</p>\n<p>If you are interested in learning databases, server side stuff and more programmatic languages, this is where my advice would be “Follow the Money”. Survey the landscape, and pick something that is also a good fit for you. Python and Ruby are both still pretty big right now. Perl not so much, and everyone hates on PHP, although it is still relevant today. Everything will be different in 5-10 years, so try to find a language with a lot of users and companies behind it. If there are new technologies emerging from the corner of the web world you find yourself in (like Twig for PHP, Sass for CSS, etc,), pay attention to those, and jump aboard once they really take off.</p>\n<p>Finally, keep paying attention to HTML, CSS and Javascript. These technologies are not static and new browser versions are shipping new features you can start taking advantage of. Because browser support is really good, the next thing I'm planning to sit down and learn is Flexbox.</p>\n<h2 id=\"job-titles-and-job-hunting\">Job titles and job hunting <a class=\"direct-link\" href=\"#job-titles-and-job-hunting\">#</a></h2>\n<p>One of the lessons you will learn early on as an everyday developer is that there is no standardization in what people call themselves. &quot;Web designer&quot;, &quot;front-end developer&quot;, &quot;UX designer&quot;, &quot;interaction designers&quot;, could all be the same person. I prefer to keep it simple and say &quot;web designer&quot;. Because I do print work too, sometimes its &quot;communication designer.&quot; This is good enough an answer for the &quot;what do you do?&quot; question at dinner parties.</p>\n<p>If I were job hunting, the best advice would be to use whatever is the job title advertised. But look out for red flags in position descriptions: <em>&quot;5+ years of React.js experience&quot;</em> is terrible, because React has only been out for two years. Confusing Java with Javascript is probably the result of a non-technical person attempting to write a technical job description. I've found that the better jobs advertised aren't super prescriptive for every little technical thing. They know that new things are going to come along, and are probably more interested in <em>how</em> you work, than every tiny thing you are aware of.</p>\n<h2 id=\"people-skills\">People Skills <a class=\"direct-link\" href=\"#people-skills\">#</a></h2>\n<p>Becoming an everyday developer means working with clients and other people. Good communication skills are a requirement. Practice your interviewing and presentation skills. When you are getting the project specs from a client, you are like a researcher or journalist, not an interrogator. When you are <a href=\"https://medium.com/@monteiro/13-ways-designers-screw-up-client-presentations-51aaee11e28c\">showing work for sign-off and approval</a>, think of it as a sales presentation. You don't need to be Don Draper or Billy Mays. Focus on the goals and the pain points you are solving. You are selling it, but you are not defending it in court, and you are not a tour guide.</p>\n<p>Learn how to be a good listener. Learn how to be a <a href=\"http://www.slideshare.net/JennLukas/a-guide-to-49840642\">great co-worker</a>. Empathize with your clients. Have as much or more empathy for their customers. Ego management is a <a href=\"https://deardesignstudent.com/we-re-all-imposters-95d6aef8053f\">core design skill</a>. Megan Hustad's <em><a href=\"https://www.goodreads.com/book/show/2993383-how-to-be-useful\">How to Be Useful</a></em> is a great read if you are more than a little skeptical/cynical about anything in the &quot;business book&quot; or &quot;self-help&quot; section of the bookstore. At the end of the day, remember, its a job.</p>\n<p>Also, the technology industry is rotten with misogyny, racism, and entitlement; don't be one of those jerks. Call out this BS when you see it. Always remember this: you aren't designing things for screens, you are designing for humans.</p>\n<h2 id=\"further-reading%3A\">Further Reading: <a class=\"direct-link\" href=\"#further-reading%3A\">#</a></h2>\n<ul>\n<li>Chris Ferdinandi, <em><a href=\"http://gomakethings.com/downloads/wicked-fast-websites-ebook/wicked-fast-websites.pdf\">Wicked Fast Websites</a></em></li>\n<li>Stephen Hay, <em><a href=\"http://www.the-haystack.com/2015/07/03/my-name-is-stephen-and-im-a-generalist/\">My name is Stephen and I'm a generalist</a></em></li>\n<li>David Kadavy, <a href=\"http://designforhackers.com/blog/how-to-learn-web-design/\">How to Learn Web Design</a></li>\n<li>Erik Runyon, <a href=\"http://erikrunyon.com/2014/01/lessons-learned-from-my-first-semester-of-teaching/\">Lessons learned from my first semester of teaching</a></li>\n<li>Kylie Timpani, <a href=\"https://humaan.com/blog/dear-developer-love-designer/\">Dear Developer. Love, Designer.</a></li>\n<li>The Web Ahead, ep. 101: <a href=\"http://thewebahead.net/101\">Structuring Content with Eileen Webb</a></li>\n</ul>\n",
      "date_published": "2015-09-07T00:00:00Z"
    },{
      "id": "https://nicksimson.com/posts/2015-everyday-developers/",
      "url": "https://nicksimson.com/posts/2015-everyday-developers/",
      "title": "Everyday developers",
      "content_html": "<p>I always enjoy <a href=\"http://thewebahead.net\">The Web Ahead</a> podcast, hosted by <a href=\"http://jensimmons.com/\">Jen Simmons</a>. For the past 4 years and over 100 episodes, Jen has been researching very specific topics, booking the best possible guests, and then going deep into that subject matter for a good hour or so. I make it a point to catch up after each episode is published, as I've found it to be an indespensible resource to keep up with new technologies and conversations surrounding the world wide web, and the people who work on it.</p>\n<p><a href=\"http://thewebahead.net/104\">A recent episode released on August 13</a>, featured a conversation between Jen and her guest <a href=\"https://rachelandrew.co.uk/\">Rachel Andrew</a> about &quot;everyday developers&quot;. Actually, the word &quot;everyday&quot; only came up once during the discussion, but they were describing a type of web generalist who builds sites for clients, perhaps as a freelancer or as part of a small team. I consider myself a part of this camp.</p>\n<p>Five years ago, Elliot Jay Stocks' <a href=\"http://www.elliotjaystocks.com/blog/web-designers-who-cant-code/\">&quot;Web designers who can't code&quot;</a> article launched a firestorm of tweets, blog posts, and debates about the division of labor between &quot;design&quot; and &quot;development&quot;. Nine years before that, Jeffery Zeldman had written a book, <a href=\"takingyourtalenttotheweb.com/\"><em>Taking Your Talent to the Web</em></a> for transitioning print designers. Each year, it feels like the lines between &quot;design&quot; and &quot;development&quot; <a href=\"http://bradfrost.com/blog/post/development-is-design/\">are finally getting fuzzier</a>, and I think that is a beautiful thing.</p>\n<p>Jen and Rachel both bring a valuable perspective to this topic, because they were once living it themselves. Today they are prominent speakers and in-demand CSS layout experts, but both came to the web early on, building websites for people who really needed them, and for others like them, who were just figuring out how to put their stuff online. In the mid-1990s, almost anyone designing a website was a novice or a pioneer, learning how things work, making mistakes along the way, and developing the techniques and hacks that others would quickly rely on.</p>\n<figure>\n<blockquote>...Web technology was not that complicated 15 years ago. It was possible for a person to come from a design background, be more focused on design, and yet know pretty much everything there was to know about the development side. You wrote HTML and CSS and used FTP to put the files on the&nbsp;server.</blockquote>\n<figcaption>\nJen Simmons, <cite><a href=\"http://thewebahead.net/104\">The Web Ahead, Ep. 104</a></cite>.</figcaption></figure>\n<p>Today, you may still find a few people learning or deploying their sites that way, but on the other side of the spectrum there are websites and web applications that are almost like utility services, delivering video entertainment, family photos, and breaking news at speeds and resolutions unheard of to devices that only existed in someone's imagination 20 years ago. The Facebooks, Googles and Netflixes of the world have armies of developers (sometimes referred to as &quot;engineers&quot;) working with complex sets of digital tools, releasing powerful frameworks and libraries every couple months.</p>\n<p>In between these two, you have what Jen and Rachel would call &quot;everyday developers,&quot; which is possibly the widest gamut of web workers. Not all these people have Computer Science or graphic design degrees. Some are at ad agencies, some are working in-houses at companies and organizations you've heard of, but don't think about on a daily basis. A handful might be working on small web applications, but the majority are focused on some kind of publishing or marketing. They may be lucky to attend a conference every couple years, but are rarely on the speaker stage at a sposored industry conference or featured in a trade magazine. A few of today's everyday developers will be the engineers, authors, and speakers of tomorrow. Mostly they are out there in huge numbers, maintaining the CMS at their university, writing some vanilla Javascript, doing great work for their clients every day.</p>\n<p>A few highlights from the episode:</p>\n<h2 id=\"on-documentation\">On documentation <a class=\"direct-link\" href=\"#on-documentation\">#</a></h2>\n<p>Writing documentation on your open-source project is doing good work:</p>\n<figure>\n<blockquote>\nSo often we have people saying, \"What's happened?\" What they'll say is, Perch, our product, has removed all of the spacing between their paragraphs. I open up the site, look in the browser inspector, and they've got a reset stylesheet which is removing all the spacing between their paragraphs. They've put it in there. We don't put it any code. We didn't put the CSS in. They've included something and don't know what it is. They don't know what it does...That is happening a lot. People are taking bits and pieces from around the web. They're using things as a starting point. Those things, individually, are very good. People are putting them out there, on GitHub or whatever, assuming that everyone who would use it has the same level of knowledge as they do. Of course, they don't.\n</blockquote>\n<figcaption>\nRachel Andrew, <cite><a href=\"http://thewebahead.net/104\">The Web Ahead, Ep. 104</a></cite>.\n</figcaption>\n</figure>\n<p>This is one that has really made a difference for me. Don't assume everyone who is using your code has the same skills, background, or comfort level as you. Help beginners move forward by providing some kind of entry point. At minimum, put comments in your unminified files explaining what each bit does. Even better, provide a simple demo if possible, so we can see what your code accomplishes. Does your project require installing a library or package manager in the terminal? A lot of web designers aren't as comfortable on the comand line: I used <a href=\"http://mixture.io/\">Mixture</a> for a good year and a half before I finally switched to <a href=\"http://gulpjs.com/\">Gulp.js</a> earlier this year. Even linking to a good tutorial could help someone a long way. Can you offer a downloadable version without dependencies?</p>\n<p>Interoperability in open source web projects is a nice ideal to aim for, when it makes sense. I'm a big fan of Chris Ferdinandi's <a href=\"https://cferdinandi.github.io/kraken/\">Kraken project</a>. The components of this web starter kit are designed to be modified or removed completely without breaking a lot (A little like Bootstrap or Foundation, but much smaller fewer frame-work specific classes). It uses some familiar conventions, and avoids becoming over-opinionated. He's also created some useful Javascript add-ons (each with their own demo) that are coded in a way that could independently on projects that aren't using the same Kraken's conventions.</p>\n<p>I also appreciate the direction the <a href=\"http://roots.io\">Roots</a> team is taking with their open source WordPress projects. The next version of their starter theme will be shipped without Bootstrap, and require fewer dependencies, so you can install your preferred front-end boilerplate (or create your own). Similarly, their development and deployment packages aren't dependent on installing their starter theme or set of plugins.</p>\n<h2 id=\"on-the-right-tools-for-the-right-people\">On the right tools for the right people <a class=\"direct-link\" href=\"#on-the-right-tools-for-the-right-people\">#</a></h2>\n<p>While Javascript frameworks and build processes have gotten a ton of attention, the bread and butter for a lot of everyday developers is still the content management system—customizing them, theming them, training clients and authors on how to use them. Once your work is done, what do your clients inherit?</p>\n<blockquote>\n<p>I think a lot, as I move through the project, about what I'm going to be leaving behind. I think a lot about the legacy they're going to have. If I build this site for you on Drupal, you're going to have to have someone to maintain that Drupal instance. That's not going to be me, because I don't enjoy that. I can hook you up with someone else and recommend somebody and they'll do it. Or I can teach you the skills if you're a person that can learn those skills and you can do it. What I cannot do is just put you on this system that needs regular updates and those updates which take a certain level of technical savvy and then never talk to you about it and walk away and leave you with security flaws. We're going to have that conversation at the very beginning because I need to suss out whether or not you can handle the responsibility of babysitting a Drupal website for the next five years. If you can't, then I'm going to make a different choice for you. I'm going to put you on Squarespace or <a href=\"http://wordpress.com\">wordpress.com</a>. I'm going to put you on something where you don't have to update your own software.</p>\n</blockquote>\n<p>I wouldn’t feel great either about handing off a WordPress or Drupal site to a client without extensive training (raising the price and billable hours) on updating the plugins and themes, security, and other infrastructure-y things if they aren’t already experienced or eager to do this themselves. Most clients' priorities are investing their time into creating great content (the stuff their customers and audiences actually see) and running their business. I don't think it makes much financial sense for most web designers to get into the hosting business either, when the money and time saved for both parties could be put back into the business, towards crafting a distinct visual design, or chasing higher-paying contracts.</p>\n<p>Jen elaborates a little further:</p>\n<blockquote>\n<p>Like I said, I used to do all of these small projects. Now I can't afford to do them. But I still have people come along [with minimal budgets] and they want to know, &quot;How can I build a website?&quot; I want artists and restaurants and nonprofits to have affordable websites. If I were to recreate that kind of business that I used to have, I might seriously think about being a Squarespace shop. I would help people think through their content strategy and business and take all of that content and put it on Squarespace or <a href=\"http://Wordpress.com\">Wordpress.com</a>.</p>\n</blockquote>\n<p>I did this myself recently. I still think self-hosted WordPress is great, but sometimes even that is too much for some clients. It takes a lot of custom work to get WordPress working like Squarespace's draggable visual blocks of editable content. For small businesses and artists, what Squarespace and <a href=\"http://WordPress.com\">WordPress.com</a> offer is great. Squarespace itself wants developers to customize their sites, and make money with their beautiful suite of editing tools, offering their own <a href=\"https://developers.squarespace.com/\">developer platform</a> with command line tools and a blank HTML5 Boilerplate-based theme.</p>\n<p>There's also been an explosion of many new, next-generation CMS products out there that aren’t Wordpress or Drupal clones. Craft, Siteleaf, and Cloud Cannon all look very promising for everyday users and everyday developers alike.</p>\n<h2 id=\"on-teaching%2C-training%2C-learning\">On teaching, training, learning <a class=\"direct-link\" href=\"#on-teaching%2C-training%2C-learning\">#</a></h2>\n<p>Both Jen and Rachel work on complex projects, lead workshops, and deliver talks on this stuff, yet admit that if they were starting out in their careers tomorrow, it would be a bit overwhelming to know where to start. Their audience at these worskshotps and events is largely made up of everyday developers, and I'm sure they are getting this feedback, as its a sentiment I hear expressed all the time.</p>\n<p>Part of this is, I think, the landscape. The web is not a monolith. It was originally built to help facilitate document sharing among researchers doing science, but 25 years later, it is a significant chunk of almost every sector of the economy. A website can be where you read the breaking news, or something you log in to to check your banking, or something you consume streaming video from. An application that tracks your hours for your timesheet, a social network where you see your friend's baby photos, or a word processing document synced to a cloud server. WordPress (which powers 20-something percent of the web itself) is not a monolith, either. Depending on which developer you talk to, its a blogging platform, a powerful customizable content management system, or an API for building web apps.</p>\n<p>No one can possibly learn how to build every single one of these things. No one should be expected to.</p>\n<p>Rachel wrote a great <a href=\"https://rachelandrew.co.uk/archives/2015/08/14/confidence-and-overwhelm/\">follow-up post</a> after the podcast was released, with a few thoughts about the things &quot;everyday developers&quot; should be fluent in. The good news is that these core compentencies are the three things the web has been made up for a very long time: HTML, CSS, Javascript. A solid understanding of the fundamentals and paying attention to the features and changes to these three technologies will have the biggest impact on the largest number of users. Everything that goes into sending the front-end trinity to the browser will come and go over time, but &quot;what the visitors to your site or users of your product will eventually interact with is HTML, CSS, JavaScript.&quot;</p>\n<figure>\n<blockquote>How you get to the point of delivering HTML, CSS and JavaScript to the browser is just detail. It’s detail that is influenced by a lot of factors. Tools and processes that make sense when a site is delivered and worked on by a huge team are probably overkill for a site built by a solo designer....Understand HTML and CSS, be able to build a layout without leaning on a framework. Get a solid understanding of how a website actually gets from the server to a browser, an understanding of security and accessibility. These are the basics, the constants. These things change slowly. These things sit underneath all the complexity and the tooling, the CMSs and the noise of thousands of people all trying to make their mark on this industry.\n</blockquote>\n<figcaption>Rachel Andrew, <cite><a href=\"https://rachelandrew.co.uk/archives/2015/08/14/confidence-and-overwhelm/\">'Confidence and Overwhelm'</a></cite></figcaption>\n</figure>\n<p>More good news: The web is very forgiving. What you build today will work for years—even as browsers automatically update and hardware gets replaced—providing you are doing these core things right. I love coming across a website that was last updated in 2005 or earlier. A couple links may be broken and the design may not reflect the current trends or resolutions, but its somewhat reassuring that not everything is as ephemeral as it seems.</p>\n<h4 id=\"further-reading\">Further reading <a class=\"direct-link\" href=\"#further-reading\">#</a></h4>\n<ul>\n<li>Chris Ferdinandi, <a href=\"http://gomakethings.com/kraken-sass-and-open-source/\">Kraken, Sass, and Open Source</a></li>\n<li>Aaron Gustafson, <a href=\"http://www.aaron-gustafson.com/notebook/a-fundamental-disconnect/\">'A Fundamental Disconnect'</a></li>\n<li>Jeremy Keith, <a href=\"https://adactio.com/journal/1665\">'The Format of the Long Now'</a></li>\n</ul>\n",
      "date_published": "2015-08-31T00:00:00Z"
    },{
      "id": "https://nicksimson.com/posts/2015-reading-is-hazardous/",
      "url": "https://nicksimson.com/posts/2015-reading-is-hazardous/",
      "title": "Reading is hazardous",
      "content_html": "<p><a href=\"http://www.wavepoetry.com/products/madness-rack-and-honey\"><img class=\"book\" src=\"/img/post-images/ruefle-madness.jpg\" alt=\"Cover of Madness, Rack, and Honey\" /></a></p>\n<p>I became aware of Mary Ruefle’s collection of “lectures” with an unusual title after reading the reflections by <a href=\"http://aworkinglibrary.com/reading/madness-rack-and-honey/\">Mandy Brown</a> and <a href=\"https://frankchimero.com/blog/2014/madness-and-rowing/\">Frank Chimero</a> on their personal blogs. When two or more sources I trust recommend the same thing, I usually start paying attention.</p>\n<p>I keep “lectures” in quotations, as the author herself points out that each was carefully written before delivered orally, despite the fact she was told her graduate students would prefer informal, spontaneous talks. Ruefle maintains that writing is her “natural act”, and as individual essays, these lectures work wonderfully.</p>\n<p>Ruefle’s prose is marked by an economic use of words fitting for a poet, and she prioritizes her allegiances to poetry and art over knowledge and intelligence. Two mini-collections within the volume are titled “Twenty-Two Short Lectures” and “Lectures I Will Never Give”, and contain several vignettes that could be delivered in under two minutes.</p>\n<figure>\nAn example:\n<blockquote cite=\"Ruefle, Madness, Rack, and Honey, p. 238\">\n    You know how to write poetry, it is all you need to be happy, but you will not be happy, you will be miserable, thinking you need so many other things, and in years and years of misery, you have only one thing, as poets, to look forward to, the day you will not want what you haven’t got, the thing you have got is poetry, let nothing cheat, steal or deflect you from it, even poetry itself. Why are you sitting there? You should have fled before I finished the first sentence.\n</blockquote>\n<figcaption>\nMary Ruefle, &ldquo;Short Lecture on Your Own Happiness&rdquo;, from <cite><em>Madness, Rack, and Honey</em>, p. 238</cite>.</figcaption>\n</figure>\n<p>Other chapters are fragmented with citations (Beckett, Kafka, Keats, Rilke, Roethke, Yeats, among many others) and memories, dictionary definitions, occasional advice, and haunting descriptions of art. An art installation by <a href=\"https://www.youtube.com/watch?v=zg4jOBR083I\">Anna Schuleit Haber in Northampton, Mass</a> supercedes Rufle’s desire to deliver a lecture &quot;on asylum&quot;, but her description of the event is nonetheless startling and sublime. No fragment is incomplete on its own merits, but connections are made between various art forms in surprising and delightful ways.</p>\n<p>She describes a memory, at age eighteen reading out loud the work of John Keats in a large field surrounded by cows &quot;with bells around their necks&quot;, and tears streaming down her own face. A minute later, my own synapses started firing off, and I couldn’t help thinking of the <a href=\"http://martinwestin.blogspot.com/2007/07/charlie-parker-in-sweden.html\">old myth about Charlie Parker</a>, popularized in Ken Burns’ <em>Jazz</em> documentary series, asking the tour bus to stop, and playing his saxophone to a herd of grazing cattle.</p>\n<p>Reufle writes as someone who feeds off of the written word, especially poetry, in the same way all of us need food, water, and sleep to survive. Poetry, like all other art forms, she explains in the titular essay, is a physical experience. Three pages in the <em>Oxford English Dictionary</em> are devoted to the word <em>rack</em>, she explains, describing the instrument of torture, the process of undergoing strain or dislocation, the act of tearing apart by force.</p>\n<blockquote>It is what poetry does to the world, what poets do with words, and what words will do to a poet. And that’s the rack of it. And if you have never experienced the rack of working on a poem, then you have never worked on a poem. Have you never put language in an extenuationg circumstance with dangerous limits until an acute physical sensation results?</blockquote>\n<p>To read this book is to inhabit her mind, and your enjoyment of the book will depend on your experience of briefly living inside this brain at work.</p>\n<p>A lecture on irreverence and sincerity(p. 220) pauses abruptly for the following:</p>\n<blockquote>There really <em>is</em> a beach in Western Australia where kangaroos swim in the sea and sunbathe afterward, those short white forelegs stretched in the sand</blockquote>\n<p>followed immediately by:</p>\n<blockquote>Nothing would make me happier than to see an international ban on fact-checking. </blockquote>\n<p>I don’t know how to describe this book better than the two words “strange” and “beautiful”. It’s funny too, occasionally hilarious. But buried just beneath the surface layer of the silliness lives a ton of wisdom. Highly recommended.</p>\n",
      "date_published": "2015-05-17T00:00:00Z"
    },{
      "id": "https://nicksimson.com/posts/2015-collaborating-tumbleweeds/",
      "url": "https://nicksimson.com/posts/2015-collaborating-tumbleweeds/",
      "title": "Collaborating on the new Tumbleweeds site",
      "content_html": "<figure><a href=\"http://tumbleweedsband.com/\"><img src=\"/img/post-images/tw-web-preview.jpg\" alt=\"Screenshots of The Tumbleweeds website\" /></a>\n<figcaption>A simple, responsive website design for the Tumblweeds band. <a href=\"http://tumbleweedsband.com/\">View it live</a> in the browser.</figcaption></figure>\n<p>I was contacted in the fall of 2014 by Byron Ripley about designing a website for his band, <a href=\"http://tumbleweedsband.com/\">the Tumbleweeds</a>. They play classic country and dance tunes in the Honky Tonk and Western Swing tradition. I've been friends with Byron for about ten years now, and remember the ealy days of the Tumbleweeds duo (Byron and Joe Carter) in Flagstaff/Williams, AZ.</p>\n<p>The Tumbleweeds have had an online presence on <a href=\"https://www.facebook.com/TumbleweedsMusic\">facebook</a> and <a href=\"http://tumbleweedsmusic.bandcamp.com/\">bandcamp</a> for a number of years, and felt it was time to create a proper website to match the look and feel of their music. Byron's brother <a href=\"https://github.com/littleRm\">Whitney Ripley</a> is a web developer and offered to build the new site. In 2011, I had the pleasure and opportunity to create a new logo and design a few promo items for the band, shortly after they relaunched in Albuquerque. After doing a CD package for them a couple years ago I was really glad to get called on to help translate this visual identity to the web.</p>\n<h2 id=\"kickoff-meeting\">Kickoff Meeting <a class=\"direct-link\" href=\"#kickoff-meeting\">#</a></h2>\n<p>The three of us got together via Google Hangout in mid-November to discuss the project and what needed to get done. Byron shared some of his goals for the site:</p>\n<ol>\n<li>\n<p>Make it easy for visitors and fans to find out when the band is playing.</p>\n</li>\n<li>\n<p>Make contact information easy to find to book gigs.</p>\n</li>\n<li>\n<p>Make music available for purchase/streaming and get visitors to sign up for their newsletter.</p>\n</li>\n</ol>\n<p>Other priorities we discussed were featuring large images of the band on the front page, featuring the logo as a large header image, and including video of a few performances. I made it clear early that I would plan to build responsively, making the site accessible and loading quickly on smaller screens.</p>\n <div class=\"row\">\n        <div class=\"grid-half\"><img src=\"/img/post-images/2015-03-tw-sketchbook-01.jpg\" alt=\"Image of sketchbook with notes\" loading=\"lazy\"/>\n        <figcaption>Notes from the Google Hangout discussion.</figcaption></div>\n        <div class=\"grid-half\"><img src=\"/img/post-images/2015-03-tw-sketchbook-02.jpg\" alt=\"Image of sketchbook with notes and wireframe drawings\" loading=\"lazy\"/><figcaption>More notes and thumbnail sketches for content/strucutre.</figcaption>\n        </div>\n    </div>\n<p>In the course of this initial meeting we defined roles: Byron, as the client would be responsible for final approvals and serve as liason with the rest of the band. He would also be chiefly responsible for gathering and editing website content. Whit, as developer would be configuring the domain and hosting, and most major CMS development. As designer, my role was in structuring the content, visual design (type, image, and color) and developing a mockup as a static HTML/CSS prototype.</p>\n<p>We also determined what the content needed to be, how much was already available and what may need to be written. Byron and I had previously used Dropbox when I worked on the Tumbleweeds' first CD &quot;Roll On&quot;, so we used the same shared folder and created a new subfolder for the website project:</p>\n<img class=\"browser\" src=\"/img/post-images/2015-03-tw-dropbox-folders.jpg\" alt=\"Screenshot of Dropbox folder\" loading=\"lazy\">\n<p>We used Dropbox to store the latest versions of written content, hi-res photos and links to externally hosted items. The folders are named by content type, not necessarily navigation items, knowing that this could change in the course of the project timeline.</p>\n<h2 id=\"prototyping-design\">Prototyping Design <a class=\"direct-link\" href=\"#prototyping-design\">#</a></h2>\n<p>With a few pages, images and bios completed after Thanksgiving, I had enough content to start prototyping. This was truly an exercise in <a href=\"http://www.markboulton.co.uk/journal/structure-first-content-always\">&quot;content-first&quot;</a> design. Instead of using image editing software like Photoshop or Illustrator to create a &quot;mockup&quot; of a page, I planned to write the design as a structured HTML document and use CSS to style the layout. I prefer designing this way because it forces you to consider the content (and the code) that will end up in the final product early and often. One of my favorite prototyping tools is <a href=\"http://mixture.io/\">Mixture</a>,an app that fires up a little development server on your local computer complete with a templating engine and preprocessor support.</p>\n<p>I had recently relaunched my personal site in late November, and used a <a href=\"https://github.com/nsmsn/tw/tree/master/assets/sass\">similar approach</a> to writing my CSS styles in the Sass syntax. This approach works well on fairly simple sites like this one and the Tumbleweeds, and keeps me thinking about the cascade of the compiled file itself. I like being able to find all different parts listed alphabetically in one folder, and using the <code>@import</code> function to manage the cascade order.</p>\n<p>I had an opportunity to build up a visual identity for the band over time, initially with the Tumbleweeds logo and a bumper sticker, followed a CD package. The key parts of this visual language are a rich color pallette anchored by a warm red, and period/genre appropriate typefaces and lettering. Designing a site with multiple pages, video and audio presented an opportunity to expand this graphic identity a little further. I chose two slab serif typefaces available as webfonts from Google. The display type (<a href=\"https://www.google.com/fonts/specimen/Vast+Shadow\">Vast</a>), looks like it comes out of an old playbill or Hollywood western movie poster. The subheadings and body text uses <a href=\"http://www.huertatipografica.com/fonts/bitter-ht\">Bitter</a>, a very readable font for the screen.</p>\n<div class=\"row\">\n<div class=\"grid-half\"><figure><img src=\"/img/post-images/2015-03-tw-colors.png\" alt=\"Screenshot of color pallette\" loading=\"lazy\" />\n<figcaption>I used Adobe Illustrator to develop the color palette and went back into the code editor to add color to the static prototype</figcaption></figure></div>\n<div class=\"grid-half\"><img src=\"/img/post-images/2015-03-tw-proto.jpg\" alt=\"Screenshot of web prototype\" loading=\"lazy\" /></div>\n    </div>\n<p>Once I had worked some of the fonts, colors and logo into my HTML documents, I sent screenshots to Byron to show the visual direction I was going in. Working with live embeddable media from YouTube and Bandcamp was also helpful at this early stage for writing responsive breakpoints and containers to house multimedia content in. Bandcamp's audio player, for example, adapts to its container width.</p>\n<p>I had already created two versions of the Tumbleweeds logo back in 2011, a horizontal banner and a logo contained in a circular shape. One of my favorite details of the site is how this logo changes from mobile and tablet styles to desktop.</p>\n<p>By late December, most of the site content was already finalized except for a few musician bios. There were enough finished bios and photos that it was clear how those individual items would be eventually structured. Mixture outputs static HTML and I used the <a href=\"http://www.dropboxwiki.com/tips-and-tricks/host-websites-with-dropbox\">'Public' folder in Dropbox</a> to host a live interactive prototype with the primary navigation. We were able to make revisions in the browser fairly quickly, and after 3 iterations, the site was ready for production.</p>\n<h3 id=\"getting-ready-for-the-handoff\">Getting Ready for the Handoff <a class=\"direct-link\" href=\"#getting-ready-for-the-handoff\">#</a></h3>\n<p>In our kickoff meeting we decided to explore WordPress as a possible CMS since it was something Whit and I were both accustomed to working with, and fairly user-friendly. While I was prototyping, Whit set up WordPress on Byron's hosting plan and created logins for all 3 of us. I had used the <a href=\"http://gigpress.com/\">Gigpress</a> plugin before, and suggested we try it out for managing the calendar. GigPress comes with a customizable stylesheet, so I was able to use this as a fundation to build table styles in a CSS file to use later in production.</p>\n<p>I hadn't sent off an interactive prototype like this to another developer before, so I wasn't sure what to expect. I created a <a href=\"https://github.com/nsmsn/tw\">GitHub repo for the prototype</a> where Whit could download my CSS, JavaScript and HTML to use in a WordPress theme. The handoff went smoothly, and Whit worked dilligently and integrated some simple, intuitive functionality into the backend. A metabox in the WordPress editor for the home page controls the quote and slideshow images, and the order of the images can be changed by dragging and dropping them around. The grid layouts for various pages are achieved in metaboxes for different sections, or as shortcodes in the content editor itself.</p>\n<div class=\"row\">\n        <div class=\"grid-half\"><img src=\"/img/post-images/2015-03-tw-gigpress.jpg\" alt=\"WordPress back-end dropdown selector\" loading=\"lazy\" />\n<figcaption>The GigPress plugin in action: Calendar events are super-easy to create with a set of fields in the editor.</figcaption> </div>\n        <div class=\"grid-half\"><img src=\"/img/post-images/2015-03-tw-slideshow.jpg\" alt=\"WordPress back-end slideshow editor\" loading=\"lazy\" />\n<figcaption>A home page metabox in the WordPress editor makes it really simple to change out the front page slideshow.</figcaption></div>\n    </div>\n<p>Whit set up a new SSH-connected <a href=\"https://github.com/littleRm/tumbleweedsband\">GitHub repo for the theme files</a>, making further collaboration and revision control possible. The site went live toward the end of February, and we got together on another video chat to evaluate the project, exchange notes and chat about music/life events. Its always a pleasure to work with the Tumbleweeds, and Byron and his bandmates sounded very pleased with the result.</p>\n<p>A few things that worked out really well for us:</p>\n<ol>\n<li>\n<p><strong>Focused design conversations around priorities.</strong> When we were discussing the website and its content, we were discussing <em>what we wanted people to do</em> and <em>what each section should accomplish</em>. Figuing out how something should look is a later step in figuring out how to do those first two things.</p>\n</li>\n<li>\n<p><strong>Keeping performance in mind.</strong> Using the <a href=\"http://bradfrost.com/blog/web/mobile-first-responsive-web-design/\">mobile-first design principles</a> I tried to keep images on each page limited to content and branding, so the fonts and colors I chose do a lot to communicate the design atmosphere. I planned for a lot of multimedia, and choosing to use CDN-enabled services like YouTube and Soundclound to host media files and fonts offloads a ton of weight off the server. A small amount of JavaScript is used, just for the slideshow and mobile toggle menu. Whitney carried this further using smart caching plugins to minify these assets on the live site.</p>\n</li>\n<li>\n<p><strong>Mutual respect.</strong> In our initial meeting we definied each person's role and tried to sketch out a realistic timeline for when things needed to get done. It was really helpful to have things like content gathering, visual design, and hosting/CMS configuration going on simultaneously, as the three of us were able to focus on our individual contributions, and balance our other work and life priorities. Byron has an infant daughter at home, and Whit and I both have full-time jobs, so it made a lot of sense to organize the project into milestones more than deadlines.</p>\n</li>\n</ol>\n<p>It always feels really great to ship a design and see it in the wild. On this particular site, I really enjoyed opening up the design process a little more and exploring different tools to enable remote collaboration. Five different technologies (email, Dropbox, Hangouts, GitHub, WordPress) may seem like a lot to collaborate, but each of these things serves a different purpose and does that one thing really well. I think it ended up being just the right amount for the three of us, with very little friction. I'm looking forward to taking what I've learned from working on this site and applying it to my design process in future projects.</p>\n<p>That's enough out of me...<a href=\"http://tumbleweedsband.com/album/\">give this band a listen</a>!</p>\n",
      "date_published": "2015-03-07T00:00:00Z"
    },{
      "id": "https://nicksimson.com/posts/hello-world/",
      "url": "https://nicksimson.com/posts/hello-world/",
      "title": "Deploy",
      "content_html": "<p>Hello, world.</p>\n<p>What should a web designer's personal website look like in 2014? That's a good question, and one I'm still wrestling over. I had a big 'coming soon' splash page up here for several more months than I originally planned, and have had a lot of time to think about this. I haven't figured it all out yet, but have been itching to write about some other stuff (more on that later). Here are some thoughts:</p>\n<h2 id=\"a-place-to-try-stuff-out\">A place to try stuff out <a class=\"direct-link\" href=\"#a-place-to-try-stuff-out\">#</a></h2>\n<p>A portfolio is really important if you're trying to get hired. At the moment, I'm happily employed, so I'm treating mine as sort of a &quot;Greatest Hits&quot; section.</p>\n<p>I don't fancy myself a professional writer, but I use writing as a way to organize my thoughts and communicate ideas to others. Having some kind of blog is helpful for others to find you, and figure out what you're about. I am not going to make any kind of promises about the frequency, length, or format of my posts, but I will make a few things clear:</p>\n<ul>\n<li>\n<p>I am not writing on behalf of my employers or the people who pay me. I won't discuss specific clients or projects without explicit permission.</p>\n</li>\n<li>\n<p>Its impossible to completely separate Nick the designer from Nick the private citizen. That said, the content will skew largely toward the former. If you are more interested in the latter, you probably know a much better way to get in touch with me for those details.</p>\n</li>\n<li>\n<p>You will not see any variant of the words &quot;Wow, I haven't written a blog post in a long time&quot; on this website. If I go several months without publishing any content here, regrets will be privately held, but no written apologies will be made.</p>\n</li>\n</ul>\n<p>Finally, I am planning to play and experiment with the design and code of this site a lot. I have been interested in learning to use GitHub, and the free hosting on GitHub pages seemed like a logical choice. I'm keeping the site's content and structure simple by design, so the presentation can evolve as the site evolves.</p>\n<p>The flexibility of the templating software (Jekyll and Liquid) will allow for little one-off designs and side projects to be hosted from this main domain. As a designer, nearly all the code I write is simple HTML, CSS and Javascript, and this approach frees me from having to worry or check up on databases and server-side stuff. If you are interested in how this site is put together, I am curating a <a href=\"/info/resources/\">resources page</a> with more information about the tech and tools I am using.</p>\n<h2 id=\"audience\">Audience <a class=\"direct-link\" href=\"#audience\">#</a></h2>\n<p>Who reads these things? I thought about my interests and topics and narrowed it down to three groups of people:</p>\n<ol>\n<li>Anyone involved in the creation of web content, software, or design. Content strategists, developers, fellow designers and people who work with these sorts of people on a regular basis.</li>\n<li>People who are interested in learning about design, specializing, or working with a designer for the first time. I've been at this for almost ten years now, which feels like a long time, but in many ways I still feel like I'm just getting started.</li>\n<li>People who already know me—Colleagues, friends, and family (Hi mom!)—and are interested in what I'm up to.</li>\n</ol>\n<h2 id=\"content\">Content <a class=\"direct-link\" href=\"#content\">#</a></h2>\n<p>I've drafted or am in the process of writing several blog posts to be published after this one. Before I started designing this site, I brainstormed a list of titles for the kinds of posts I eventually want to write. Most are aspirational. Some are satirical. A few are in need of a professional editor. Here are the ones I'm most excited about:</p>\n<ul>\n<li>Chasing imperfectionism</li>\n<li>Content strategist by accident</li>\n<li>Designing for others vs. designing in a vaccuum</li>\n<li>Fear of the command line</li>\n<li>Managing content in the future</li>\n<li>More top-level domains you weren't asking for</li>\n<li>Resume writing tips for designers (really)</li>\n<li>Stupid branding tricks</li>\n<li>Unsexy design projects</li>\n</ul>\n<p>I'll come back to this list and add a hyperlink once I've exhausted a topic. From time to time, I may also publish a review of a book or video on this blog.</p>\n<p>If any of this interests or intrigues you, I invite you to stick around and come back often for more. Here's an <a href=\"https://nicksimson.com/feed/feed.xml\">RSS feed</a> you can grab, and a <a href=\"https://tinyletter.com/nsmsn\">low-volume mailing list</a> you can sign up for, if you are interested in getting an email from me every 4-6 months. Thank for reading all the way to here, and more importantly, thank you for resisting the temptation to correct my grammar.</p>\n",
      "date_published": "2014-11-29T00:00:00Z"
    }
  ]
}
